{"TITLE": "Exploring Electronic Prescribing Systems and Patient Safety", "YEAR": 2020, "KEY FINDINGS": "The study found that the on-screen design of electronic prescribing systems can affect safe prescribing, and that eye tracking can be used to study users' interactions with these systems.", "MAIN RESULT": "The study identified specific interface design factors that may improve the usability and safety of electronic prescribing systems, and demonstrated the feasibility of using eye tracking to study user interactions with these systems.", "HYPOTHESIS": "Customizing the on-screen design of electronic prescribing systems to reduce information overload and improve the visibility of critical information can reduce medication errors and improve patient safety.", "EXPERIMENT": {"Title": "Customized On-Screen Design and Medication Errors", "Objective": "To investigate the effect of customized on-screen design on medication errors in electronic prescribing systems.", "Equipment": "Electronic prescribing system, eye tracking device, simulation software", "Steps": ["Recruit 20 prescribers with experience using electronic prescribing systems", "Randomly assign participants to one of two groups: control group (standard on-screen design) or intervention group (customized on-screen design)", "Ask participants to complete a series of prescribing tasks using the electronic prescribing system, with the system configured to either the standard or customized on-screen design", "Use eye tracking to record participants' visual attention and behavior during the tasks", "Measure the number of medication errors made by each participant", "Compare the number of medication errors between the control and intervention groups"]}, "KEYWORDS": ["Electronic Prescribing Systems", "Patient Safety", "Medication Errors", "On-Screen Design", "Eye Tracking", "Usability", "Human-Computer Interaction", "Healthcare Technology", "Prescription Errors", "Medical Informatics"], "ID": "0036c1984845cc4400735dd4e2a095425a4e1e57"}
{"TITLE": "Design Guidelines of a Computer-Based Intervention for Computer Vision Syndrome: Focus Group Study and Real-World Deployment", "YEAR": 2021, "KEY FINDINGS": "The study identified several interface elements that affect user participation in a computer-based intervention for computer vision syndrome, including instruction pages, goal setting, compliment feedback, and mid-size popup windows.", "MAIN RESULT": "The study found that the design of the customization interface can make it possible for users to use the system more interactively, which can result in higher engagement in managing eye conditions.", "HYPOTHESIS": "Customization of interface elements based on individual user preferences can increase user participation and engagement in computer-based interventions for computer vision syndrome.", "EXPERIMENT": {"Objective": "To validate the hypothesis that customization of interface elements based on individual user preferences can increase user participation and engagement in computer-based interventions for computer vision syndrome.", "Equipment": "Computers with LiquidEye software, survey questionnaires, and eye tracking devices.", "Steps": ["Recruit 20 participants with computer vision syndrome and randomly assign them to two groups: a control group with a standard interface and an experimental group with a customizable interface.", "Ask participants to use the LiquidEye software for 2 weeks and complete survey questionnaires at the beginning and end of the study.", "Use eye tracking devices to measure user engagement and participation in the intervention.", "Compare the results between the control and experimental groups to determine if customization of interface elements increases user participation and engagement."]}, "KEYWORDS": ["Computer Vision Syndrome", "Computer-Based Intervention", "Interface Design", "Customization", "User Engagement", "Participation", "Eye Health", "Health Technology", "Human-Computer Interaction", "Design Guidelines"], "ID": "0066c6efa196cc173c86922771005a945eaddf5e"}
{"TITLE": "Managing and Billing Software for Hypermarket", "YEAR": 2024, "KEY FINDINGS": "The paper proposes a software system for managing and billing in hypermarkets, which can generate reports, store a large amount of records, and can be used for service, sales, and report generation. The system is designed to be user-friendly and can be used online and offline.", "MAIN RESULT": "The proposed system can improve the efficiency of hypermarket operations and provide a better customer experience.", "HYPOTHESIS": "The use of a digital dashboard and automated billing system can increase customer satisfaction and loyalty in hypermarkets.", "EXPERIMENT": {"TITLE": "Evaluating the Effect of Digital Dashboard and Automated Billing on Customer Satisfaction in Hypermarkets", "OBJECTIVE": "To investigate the impact of a digital dashboard and automated billing system on customer satisfaction and loyalty in hypermarkets.", "EQUIPMENT": "Hypermarket setup with digital dashboard and automated billing system, customer survey questionnaire, and data analysis software.", "STEPS": ["1. Select a hypermarket and implement the digital dashboard and automated billing system.", "2. Recruit customers to participate in the study and provide them with a survey questionnaire to assess their satisfaction and loyalty before and after using the system.", "3. Collect and analyze the data using statistical software to compare the customer satisfaction and loyalty scores before and after the implementation of the system.", "4. Compare the results with a control group that does not use the digital dashboard and automated billing system."]}, "KEYWORDS": ["Hypermarket", "Managing", "Billing", "Software", "Digital Dashboard", "Automated Billing", "Customer Satisfaction", "Loyalty", "Retailing", "Supply Chain Management"], "ID": "026b444b5854309e6cee4fe954a2350621be2350"}
{"TITLE": "Analysis of Business Intelligence Technology in the Big Data Era — A Case Study of Alibaba Group", "YEAR": 2024, "KEY FINDINGS": "The paper explores the role of business intelligence (BI) technology in enhancing user experiences and driving innovation across industries, using Alibaba Group as a case study. It highlights Alibaba's applications of BI technology, including intelligent recommendation systems, data-driven marketing strategies, and intelligent supply chain management.", "MAIN RESULT": "The paper demonstrates the critical role of BI technology in Alibaba's success, enabling the company to enhance user experiences, build loyalty, and achieve operational excellence.", "HYPOTHESIS": "The effective application of BI technology can lead to significant improvements in user satisfaction and business performance in the e-commerce industry.", "EXPERIMENT": {"TITLE": "Assessing the Impact of BI Technology on User Satisfaction in E-commerce", "OBJECTIVE": "To investigate the effect of BI technology on user satisfaction in the e-commerce industry.", "METHODS": ["Select 100 e-commerce companies, 50 with BI technology implementation and 50 without.", "Conduct surveys to measure user satisfaction among customers of each company.", "Compare the user satisfaction ratings between the two groups.", "Analyze the data using statistical methods to determine the significance of the results."], "EQUIPMENT": ["Survey software (e.g., SurveyMonkey)", "Statistical analysis software (e.g., R, Python)", "Computers and internet access"]}, "KEYWORDS": ["Business Intelligence Technology", "Big Data Era", "Alibaba Group", "Intelligent Recommendation System", "Data-Driven Decision-Making", "E-commerce", "User Satisfaction", "Supply Chain Management", "Marketing Strategies", "Artificial Intelligence"], "ID": "05ca4bc8494d27575fa23ef9425e1fc460108653"}
{"TITLE": "Experience in Developing an Auto Parts Online Store Website Using the Yii Framework and Integration with the Company's Corporate Information System", "YEAR": 2023, "KEY FINDINGS": "The paper presents the development of an online auto parts store website using the Yii framework and its integration with the company's corporate information system. The website allows customers to view product catalogs, search for auto parts by various features, and place orders online. The system also enables the company to manage its products, customers, and orders efficiently.", "MAIN RESULT": "The developed website and system improved the efficiency of customer service, reduced the cost of recruiting new customers, and increased the company's online sales.", "HYPOTHESIS": "The integration of an online store with a company's corporate information system can lead to a significant increase in online sales and customer satisfaction.", "EXPERIMENT": {"TITLE": "Measuring the Effect of Online Store Integration on Sales and Customer Satisfaction", "OBJECTIVE": "To validate the hypothesis that the integration of an online store with a company's corporate information system can lead to a significant increase in online sales and customer satisfaction.", "EQUIPMENT": "Online store platform, corporate information system, sales data tracking software, customer satisfaction survey tool.", "STEPS": ["1. Develop an online store and integrate it with the company's corporate information system.", "2. Collect sales data for a period of 6 months before and after the integration.", "3. Conduct customer satisfaction surveys before and after the integration.", "4. Compare the sales data and customer satisfaction ratings before and after the integration.", "5. Analyze the results to determine if there is a significant increase in online sales and customer satisfaction."]}, "KEYWORDS": ["online store", "Yii framework", "corporate information system", "auto parts", "e-commerce", "customer service", "online sales", "customer satisfaction", "integration", "web development"], "ID": "061ff963ca8a75ef1ab698496e5b238589eed135"}
{"TITLE": "Adaptation of a Theory-Based, Clinic-Affiliated Smartphone App to Improve HIV Testing and Pre-exposure Prophylaxis Uptake Among Gay, Bisexual, and Other Men Who Have Sex With Men in Malaysia", "YEAR": 2022, "KEY FINDINGS": "The study found that a tailored HIV-prevention app would be acceptable for gay, bisexual, and other men who have sex with men (GBMSM) in Malaysia, and provided detailed recommendations for the successful adaptation and refinement of the existing platform for optimal use in the Malaysian context.", "MAIN RESULT": "The study suggests that a smartphone app can be an effective tool for improving HIV testing and pre-exposure prophylaxis (PrEP) uptake among GBMSM in Malaysia.", "HYPOTHESIS": "A culturally tailored HIV-prevention app can increase HIV testing and PrEP uptake among GBMSM in Malaysia by providing a convenient, private, and stigma-free platform for accessing HIV prevention services.", "EXPERIMENT": "A randomized controlled trial (RCT) can be conducted to validate the hypothesis. The experiment would involve recruiting 200 GBMSM in Malaysia and randomly assigning them to either a control group or an intervention group. The intervention group would have access to the adapted HIV-prevention app, while the control group would not. The primary outcome would be the proportion of participants who undergo HIV testing and initiate PrEP within 6 months. The experiment would require: 1) a smartphone app development team to adapt the HealthMindr app for the Malaysian context, 2) a research team to recruit and enroll participants, 3) a data analysis team to analyze the results, and 4) a statistician to conduct the RCT analysis. The steps to follow would be: 1) develop the adapted app, 2) recruit and enroll participants, 3) randomize participants to either the control or intervention group, 4) provide access to the app for the intervention group, 5) collect data on HIV testing and PrEP uptake, and 6) analyze the results.", "KEYWORDS": ["HIV", "HIV prevention", "pre-exposure prophylaxis", "PrEP", "HIV testing", "men who have sex with men", "MSM", "mHealth", "eHealth", "Malaysia", "focus groups"], "ID": "072af280c788ebbe6054e90980c14f6ef6f912d8"}
{"TITLE": "Developing an Intranet-Based Lymphedema Dashboard for Breast Cancer Multidisciplinary Teams: Design Research Study", "YEAR": 2020, "KEY FINDINGS": "The study developed and evaluated two prototype dashboards for displaying data on the identification and management of lymphedema in breast cancer patients. The dashboards were designed to make clinical data more accessible to health professionals, and the study found that health professionals were interested in using data visualization tools to support clinical decision making and performance review.", "MAIN RESULT": "The study demonstrated the feasibility of developing a clinical dashboard for breast cancer multidisciplinary teams, and highlighted the importance of co-design and user-centered design principles in the development of such dashboards.", "HYPOTHESIS": "The use of clinical dashboards to visualize lymphedema data can improve the early identification and management of lymphedema in breast cancer patients, leading to better patient outcomes.", "EXPERIMENT": {"Objective": "To evaluate the effectiveness of a clinical dashboard in improving the early identification and management of lymphedema in breast cancer patients.", "Design": "Randomized controlled trial", "Participants": "Breast cancer patients at risk of developing lymphedema", "Intervention": "Access to a clinical dashboard visualizing lymphedema data", "Control": "Standard care without access to the dashboard", "Outcome measures": "Time to diagnosis of lymphedema, severity of lymphedema, patient-reported outcomes", "Equipment": "Clinical dashboard software, computers or tablets for data access, bioimpedance spectroscopy machine for lymphedema measurement", "Steps": "1. Recruit participants and randomize to intervention or control group. 2. Provide access to the dashboard for the intervention group. 3. Collect outcome measures at baseline, 3 months, and 6 months. 4. Compare outcomes between groups."}, "KEYWORDS": ["eHealth", "clinical informatics", "human-centered design", "data visualization", "lymphedema", "breast cancer", "multidisciplinary teams", "clinical decision making", "performance review", "patient outcomes"], "ID": "09d855cca4ba70cd384188d27cb52442f0546b44"}
{"TITLE": "UI/UX Design Web-Based Livestock Sale Using Design Thinking to Rapid Prototyping", "YEAR": 2023, "KEY FINDINGS": "The design of a livestock sales website using the design thinking method can make it easier for people to process the business of buying and selling livestock via the internet. The website design is centered on user-focused design and prioritizes user centric and ease of use.", "MAIN RESULT": "The design solution gets a value of 81.78%, which is included in the very good category.", "HYPOTHESIS": "The use of a design thinking approach in developing a livestock sales website can increase the efficiency and effectiveness of livestock trading, leading to increased economic benefits for farmers and traders.", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of a Design Thinking Approach in Livestock Sales Website Development", "OBJECTIVE": "To investigate the impact of a design thinking approach on the efficiency and effectiveness of livestock trading using a web-based platform.", "METHODS": ["Recruit 100 farmers and traders to participate in the study.", "Divide participants into two groups: a control group using a traditional livestock trading method and an experimental group using the design thinking-based livestock sales website.", "Measure the time and cost of livestock trading for both groups.", "Conduct surveys to assess user satisfaction and ease of use of the website.", "Compare the results between the two groups to determine the effectiveness of the design thinking approach."], "EQUIPMENT": ["Computers or mobile devices with internet access", "Survey software or tools", "Timing and cost tracking software or tools"]}, "KEYWORDS": ["Design Thinking", "User Experience (UX)", "User Interface (UI)", "Livestock Sales", "E-commerce", "Website Development", "Economic Benefits", "Farmers", "Traders", "Efficiency", "Effectiveness"], "ID": "10c69226fe939a2c9ec95beab0f31beffd439d4a"}
{"TITLE": "An Inspection of Learning Management Systems on Persuasiveness of Interfaces and Persuasive Design: A Case in a Higher Learning Institution", "YEAR": 2022, "KEY FINDINGS": "The study investigates the persuasiveness of Learning Management System (LMS) interfaces and persuasive design strategies in a higher learning institution. It uses the heuristic evaluation method to assess the persuasiveness level of LMS interfaces and the Persuasive Systems Design Model (PSD) to evaluate persuasive strategies in LMS.", "MAIN RESULT": "The study aims to identify the persuasiveness of LMS interfaces and persuasive strategies in LMS design, and to provide recommendations on design examples to increase the persuasiveness of LMS interfaces.", "HYPOTHESIS": "The persuasiveness of LMS interfaces is positively correlated with student engagement and motivation in online learning.", "EXPERIMENT": {"Title": "Investigating the Effect of Persuasive LMS Interfaces on Student Engagement", "Equipment": "LMS platform, survey questionnaire, user engagement tracking software", "Steps": ["1. Recruit 100 students to participate in the study.", "2. Randomly assign students to use either a persuasive LMS interface or a non-persuasive LMS interface.", "3. Track student engagement metrics (e.g., login frequency, time spent on the platform, course completion rate) over a 6-week period.", "4. Administer a survey questionnaire to students at the end of the 6-week period to assess their motivation and satisfaction with the LMS.", "5. Compare the engagement metrics and survey results between the two groups to determine if the persuasive LMS interface has a positive effect on student engagement and motivation."]}, "KEYWORDS": ["Learning Management System", "Persuasiveness", "Persuasive Design", "E-learning", "User Engagement", "Motivation", "Online Learning", "Higher Education", "Human-Computer Interaction", "Interface Design"], "ID": "11334f96d37271d5cab7faace8faf174d0c9503d"}
{"TITLE": "Critical Factors Influencing User Experience on Passive Exoskeleton Application: A Review", "YEAR": 2022, "KEY FINDINGS": "The paper reviews the critical factors that influence user experience when using passive exoskeletons, including engineering design, usability, flexibility, safety and ergonomics, aesthetics, accessibility, purchase cost, after-sales service, and sustainability.", "MAIN RESULT": "The authors identified nine critical factors that influence user experience on passive exoskeleton application, which can guide designers and developers to develop passive exoskeletons that satisfy users' requirements.", "HYPOTHESIS": "Passive exoskeletons with user-centered design that incorporate factors such as aesthetics, comfort, and ease of use will lead to higher user acceptance and satisfaction.", "EXPERIMENT": {"Title": "User Acceptance of Passive Exoskeletons with User-Centered Design", "Objective": "To investigate the effect of user-centered design on user acceptance and satisfaction of passive exoskeletons.", "Equipment": "Passive exoskeleton prototypes with varying design features (e.g., aesthetics, comfort, ease of use), survey questionnaires, user experience evaluation metrics.", "Steps": ["Recruit participants with mobility impairments or industrial workers who require exoskeleton support.", "Randomly assign participants to use one of the passive exoskeleton prototypes with varying design features.", "Have participants complete a series of tasks while wearing the exoskeleton (e.g., walking, standing, sitting).", "Administer survey questionnaires to assess user experience, acceptance, and satisfaction.", "Compare user experience evaluation metrics (e.g., usability, comfort, aesthetics) across different design features."]}, "KEYWORDS": ["Passive Exoskeleton", "User Experience", "User-Centered Design", "Engineering Design", "Usability", "Flexibility", "Safety and Ergonomics", "Aesthetics", "Accessibility", "Purchase Cost", "After-Sales Service", "Sustainability"], "ID": "16ff835acc0ec550f2cceff528ba1fb54957b6c4"}
{"TITLE": "Building Movie Map - A Tool for Exploring Areas in a City - and its Evaluations", "YEAR": 2020, "KEY FINDINGS": "The paper proposes a new Movie Map system that allows users to explore a city area using omnidirectional videos. The system consists of four stages: acquisition, analysis, management, and interaction. The system was evaluated against Google Street View (GSV) and showed better user experience.", "MAIN RESULT": "The proposed Movie Map system provides a better user experience than GSV, especially in terms of exploring comfort.", "HYPOTHESIS": "The use of omnidirectional videos in Movie Map can reduce the cognitive load of users when exploring a city area, leading to a more efficient and enjoyable experience.", "EXPERIMENT": {"TITLE": "Cognitive Load Comparison between Movie Map and GSV", "EQUIPMENT": "Eye-tracking device, computer with Movie Map and GSV interfaces, questionnaire", "STEPS": ["Recruit 20 participants and divide them into two groups: Movie Map group and GSV group.", "Ask each participant to explore a city area using their assigned interface and complete a task (e.g., find a specific landmark).", "Use an eye-tracking device to measure the participants' eye movements and pupil dilation during the task.", "Administer a questionnaire to assess the participants' perceived cognitive load and satisfaction with the interface.", "Compare the results between the two groups to determine if the Movie Map group shows reduced cognitive load and higher satisfaction."]}, "KEYWORDS": ["Movie Map", "Omnidirectional video", "City exploration", "Google Street View", "User experience", "Cognitive load", "Eye-tracking", "Human-computer interaction", "Geographic information system", "Virtual tour"], "ID": "176832ee8f19589e1987493daa126c1543967baa"}
{"TITLE": "Enhancing User-Engagement in the Design Process through Augmented Reality Applications", "YEAR": 2017, "KEY FINDINGS": "The paper explores the development of user interface layouts for visualizing 3D objects in an interior design context using Augmented Reality (AR) applications. It highlights the importance of designing effective user interfaces and user experiences to enhance the communication between designers and clients during the iterative design process.", "MAIN RESULT": "The study found that a well-designed AR application can improve user engagement and effectiveness in the design process, and that a customized set of heuristics can be used to evaluate the usability and effectiveness of AR applications.", "HYPOTHESIS": "The use of AR applications with customized heuristics can improve the design process by reducing the time taken to complete tasks and increasing user satisfaction.", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of AR Applications with Customized Heuristics", "OBJECTIVE": "To validate the hypothesis that the use of AR applications with customized heuristics can improve the design process.", "EQUIPMENT": "AR devices, interior design software, and a set of customized heuristics.", "STEPS": ["Recruit 20 participants with interior design experience.", "Divide participants into two groups: one using an AR application with customized heuristics and the other using a traditional design software.", "Ask participants to complete a set of design tasks using their assigned tool.", "Measure the time taken to complete each task and collect user feedback through surveys and interviews.", "Compare the results between the two groups to evaluate the effectiveness of the AR application with customized heuristics."]}, "KEYWORDS": ["Augmented Reality", "User Interface Design", "User Experience", "Interior Design", "Design Process", "Usability", "Effectiveness", "Heuristics", "AR Applications", "Design Tools"], "ID": "186f36ecc0d6571e405ace2fe62cefe234987ff6"}
{"TITLE": "Design and Evaluation of UI/UX Using the Heuristic Evaluation Method: The Case of Universitas Papua Website", "YEAR": 2024, "KEY FINDINGS": "The study found that the Universitas Papua website's UI design has minor issues, with an average severity level of 2, and identified areas for improvement, including Error Prevention, System Recovery, Help, and Documentation.", "MAIN RESULT": "The evaluation results concluded that the website's UI design needs improvement in certain aspects to enhance user experience.", "HYPOTHESIS": "Incorporating the three aspects of Error Prevention, System Recovery, and Help and Documentation into the website design will significantly improve user experience and reduce the severity level of UI design issues.", "EXPERIMENT": {"Title": "Evaluating the Effect of Enhanced UI Design on User Experience", "Objective": "To validate the hypothesis that incorporating Error Prevention, System Recovery, and Help and Documentation into the website design will improve user experience and reduce UI design issues.", "Equipment": "Computers with internet access, Universitas Papua website with modified UI design, user experience questionnaire, and heuristic evaluation method guidelines.", "Steps": ["1. Recruit 21 participants, including 4 lecturers of Informatics Engineering, to evaluate the modified website.", "2. Ask participants to complete a user experience questionnaire to assess their experience with the modified website.", "3. Conduct a heuristic evaluation of the modified website using the 10 Heuristic Principles method.", "4. Compare the results of the user experience questionnaire and heuristic evaluation with the original study's results.", "5. Analyze the data to determine if the incorporation of Error Prevention, System Recovery, and Help and Documentation into the website design has improved user experience and reduced UI design issues."]}, "KEYWORDS": ["Heuristic evaluation", "User experience", "User interface", "Website design", "UI/UX", "Error Prevention", "System Recovery", "Help and Documentation", "Universitas Papua", "Informatics Engineering"], "ID": "2604e06a9d1ca2b6b5e6b9cda7f8a6431b5efed8"}
{"TITLE": "ANALISIS POLA LAYOUT APLIKASI MOBILE COMMERCE POPULER DI INDONESIA DENGAN METODE KUALITATIF HEURISTIK", "YEAR": 2020, "KEY FINDINGS": "The study analyzed the layout patterns of mobile commerce applications in 4 popular online stores in Indonesia, namely Bukalapak, Shopee, Tokopedia, and Lazada, and found that they share similar shopping flow patterns and interface layouts, including navigation buttons on the top and bottom of the page, visual weight for promotional features, and thumb zone concepts.", "MAIN RESULT": "The study successfully proved that the 4 Nielsen principles are used by mobile commerce applications, namely Match between system and the real world, Consistency and standards, Error prevention, and Recognition rather than recall.", "HYPOTHESIS": "The use of heuristic principles in mobile commerce application design can improve user experience and increase sales conversion rates.", "EXPERIMENT": {"TITLE": "Heuristic Principles in Mobile Commerce Application Design", "OBJECTIVE": "To investigate the effect of heuristic principles on user experience and sales conversion rates in mobile commerce applications.", "METHODS": "1. Recruit 100 participants and divide them into two groups: control group and experimental group. 2. Design two versions of a mobile commerce application: one with heuristic principles applied and one without. 3. Ask participants to complete a series of tasks on both applications, such as searching for products, adding to cart, and checking out. 4. Measure user experience using surveys and sales conversion rates using analytics tools. 5. Compare the results between the two groups.", "EQUIPMENT": "Mobile devices with the two versions of the mobile commerce application, survey software, and analytics tools.", "EXPECTED OUTCOME": "The experimental group will show higher user experience ratings and sales conversion rates compared to the control group, supporting the hypothesis that the use of heuristic principles in mobile commerce application design can improve user experience and increase sales conversion rates."}, "KEYWORDS": ["Mobile Commerce", "Heuristic Principles", "User Experience", "Sales Conversion Rates", "Nielsen Principles", "Layout Patterns", "Interface Design", "E-commerce", "Indonesia", "Mobile Application Design"], "ID": "2667a59c537625b521bd3439d49d65cc1e4fb942"}
{"TITLE": "Empowering Local Retail: Leveraging E-Commerce for Small Businesses", "YEAR": 2024, "KEY FINDINGS": "The integration of e-commerce solutions with local retail businesses can enhance competitiveness, expand market reach, and improve customer satisfaction. E-commerce integration can lead to increased sales, operational efficiencies, and enhanced customer engagement.", "MAIN RESULT": "The proposed e-commerce platform tailored for local retailers can improve sales growth, customer satisfaction, and operational efficiency.", "HYPOTHESIS": "The use of personalized features, such as product recommendations and promotions, in an e-commerce platform can increase customer loyalty and retention among local retailers.", "EXPERIMENT": {"Objective": "To validate the hypothesis that personalized features in an e-commerce platform increase customer loyalty and retention among local retailers.", "Equipment": "E-commerce platform with personalized features, customer database, survey software", "Steps": ["1. Develop an e-commerce platform with personalized features, such as product recommendations and promotions, tailored for local retailers.", "2. Recruit a sample of local retailers to participate in the experiment.", "3. Randomly assign half of the retailers to the treatment group, which will receive the personalized features, and the other half to the control group, which will not receive the personalized features.", "4. Collect data on customer loyalty and retention metrics, such as repeat purchases and customer satisfaction, for both groups over a period of 6 months.", "5. Analyze the data using statistical methods to compare the customer loyalty and retention metrics between the treatment and control groups.", "6. Conduct surveys to gather feedback from customers on their experience with the personalized features and their impact on loyalty and retention."]}, "KEYWORDS": ["E-commerce", "Local Retail", "Small Businesses", "Personalization", "Customer Loyalty", "Customer Retention", "Digital Marketplace", "Competitiveness", "Operational Efficiency", "Customer Satisfaction"], "ID": "2bb0f6dc396926aded33bd6f1491af890770c5df"}
{"TITLE": "Older Adults' Perspectives on the Potential for Technology to Enhance Care in Academic Medical Centers", "YEAR": 2021, "KEY FINDINGS": "Older adults value healthcare innovation, desire to assist progress, and expressed preference for cohesive, inclusive, and engaging technologies that simplify and streamline care. They prefer user-friendly patient portals, health outcomes dashboards, and centralized electronic medical record systems.", "MAIN RESULT": "Academic Medical Centers (AMCs) have significant potential for engaging older adults in fostering sustainable, holistic, technology-enhanced care.", "HYPOTHESIS": "Incorporating older adults in the design and development of healthcare technology can lead to increased adoption and effectiveness of technology-enhanced care in AMCs.", "EXPERIMENT": {"Title": "Co-Designing Technology-Enhanced Care with Older Adults", "Objective": "To investigate the impact of involving older adults in the design and development of healthcare technology on the adoption and effectiveness of technology-enhanced care in AMCs.", "Methodology": "Recruit 20 older adults (ages 65-85) and 10 healthcare professionals to participate in a co-design workshop. The workshop will involve a series of focus groups and design sessions to develop and refine a technology-enhanced care system. The system will be tested in a pilot study with 100 older adults in an AMC setting. Outcome measures will include user satisfaction, adoption rates, and health outcomes.", "Equipment": "Focus group facilitation materials, design software (e.g. Figma), pilot study infrastructure (e.g. tablets, internet connectivity), survey and evaluation tools.", "Steps": "1. Recruit participants and conduct focus groups to gather requirements and preferences for technology-enhanced care. 2. Conduct design sessions with participants to develop and refine the system. 3. Develop and pilot test the system with 100 older adults in an AMC setting. 4. Evaluate the system's impact on user satisfaction, adoption rates, and health outcomes."}, "KEYWORDS": ["Academic Medical Center", "Technology-Enhanced Care", "Patient-Centered Care", "Older Adults", "Healthcare Innovation", "Co-Design", "User-Centered Design", "Health Outcomes", "Care Coordination", "Electronic Medical Records"], "ID": "2c1d7ea7c016465d142763284d0ec27e595e2016"}
{"TITLE": "Developing Dynamic Audio Navigation UIs to Pinpoint Elements in Tactile Graphics", "YEAR": 2022, "KEY FINDINGS": "The study developed and evaluated three dynamic audio navigation user interfaces to guide blind and visually impaired people to specific elements in tactile graphics. The interfaces were based on submarine sonar sounds, coordinate plan x and y-axis, and direct voice instructions. The voice-based navigation UI was found to be the most effective and efficient.", "MAIN RESULT": "The voice-based navigation UI guided participants the fastest to the target element and did not require prior training.", "HYPOTHESIS": "The use of voice-based navigation UIs in tactile graphic readers can improve the overall user experience and accessibility for blind and visually impaired individuals.", "EXPERIMENT": {"Objective": "To validate the effectiveness of voice-based navigation UIs in tactile graphic readers.", "Equipment": "Tactonom Reader device, tactile graphics with varying levels of complexity, audio recording software.", "Steps": ["Recruit 20 blind and visually impaired participants.", "Divide participants into two groups: one using the voice-based navigation UI and the other using a traditional trial-and-error approach.", "Ask participants to complete a series of tasks involving locating specific elements in tactile graphics using their assigned method.", "Record the time taken to complete each task and the number of errors made.", "Compare the results between the two groups to determine the effectiveness of the voice-based navigation UI."]}, "KEYWORDS": ["tactile graphics", "audio navigation", "blind and visually impaired", "accessibility", "user interface design", "tactile graphic readers", "dynamic audio navigation", "voice-based navigation", "assistive technology", "human-computer interaction"], "ID": "2cfd645f1797f56557d308f4c40c25bdf77d9250"}
{"TITLE": "Designing Commenting Mechanisms for Dynamic Media: Synchronous Overlay and Adjacent Scrollable", "YEAR": 2017, "KEY FINDINGS": "The study compared two commenting mechanisms, Synchronous Overlay (SO) and Adjacent Scrollable (AS), and found that SO led to a stronger sense of togetherness and social engagement, but participants remembered less about the comments. AS, on the other hand, allowed for better recall of comments but lacked the sense of social engagement.", "MAIN RESULT": "The design of commenting mechanisms influences user engagement and memory for comments and video content.", "HYPOTHESIS": "The sense of collective engagement in SO increases viewers' level of arousal, which compensates for the higher concentration required to process comments and video content simultaneously.", "EXPERIMENT": {"Title": "Investigating the Effect of Collective Engagement on Arousal in Synchronous Overlay Commenting", "Equipment": "Eye-tracking device, heart rate monitor, video player with SO commenting mechanism, video clips with comments", "Steps": ["Recruit 20 participants and divide them into two groups: one watching video clips with SO commenting and the other watching the same clips without comments.", "Use eye-tracking device to measure participants' attention to comments and video content.", "Use heart rate monitor to measure participants' arousal level.", "Ask participants to complete a memory test for comments and video content after watching each clip.", "Compare the results between the two groups to determine if the sense of collective engagement in SO increases arousal and compensates for the higher concentration required."]}, "KEYWORDS": ["Video commenting", "Danmaku", "Synchronous Overlay", "Adjacent Scrollable", "Social engagement", "Collective experience", "User interaction", "Commenting mechanisms", "Dynamic media", "Human-computer interaction"], "ID": "2d13d9b0ad806e81ed032e7e0e4a16b3fd316e46"}
{"TITLE": "Design Guidelines of a Computer-Based Intervention for Computer Vision Syndrome: Focus Group Study and Real-World Deployment", "YEAR": 2021, "KEY FINDINGS": "The study identified several interface elements that affect user participation in a computer-based intervention for computer vision syndrome, including instruction pages, goal setting, compliment feedback, and mid-size popup windows.", "MAIN RESULT": "The study found that the design of the customization interface can make it possible for users to use the system more interactively, which can result in higher engagement in managing eye conditions.", "HYPOTHESIS": "Customization of interface elements based on individual user preferences can increase user participation and engagement in computer-based interventions for computer vision syndrome.", "EXPERIMENT": {"Objective": "To validate the hypothesis that customization of interface elements based on individual user preferences can increase user participation and engagement in computer-based interventions for computer vision syndrome.", "Equipment": "Computers with LiquidEye software, survey questionnaires, and eye tracking devices.", "Steps": ["Recruit 20 participants with computer vision syndrome and randomly assign them to two groups: a control group with a standard interface and an experimental group with a customizable interface.", "Ask participants to use the LiquidEye software for 2 weeks and complete survey questionnaires at the beginning and end of the study.", "Use eye tracking devices to measure user engagement and participation in the intervention.", "Compare the results between the control and experimental groups to determine if customization of interface elements increases user participation and engagement."]}, "KEYWORDS": ["Computer Vision Syndrome", "Computer-Based Intervention", "Interface Design", "Customization", "User Engagement", "Participation", "Eye Health", "Health Technology", "Human-Computer Interaction", "Design Guidelines"], "ID": "31226807912ef7bf2a2f706f8613a93d91e31eab"}
{"TITLE": "Implementation of the Haptic Tele-Weight Device Using a 10 MHz Smart Torch VLC Link", "YEAR": 2022, "KEY FINDINGS": "The paper proposes a haptic tele-weight device that uses a 10 MHz smart torch VLC link to transmit weight sensor data from a virtual store to a user's headset, allowing for haptic interaction with virtual products. The device uses a pre-equalizer circuit to increase the bandwidth of the VLC link, and a post-equalizer circuit to improve the signal at the receiver side.", "MAIN RESULT": "The device was able to transmit weight sensor data with an accuracy of 0.5-3% and a bandwidth of 10 MHz, allowing for real-time haptic feedback.", "HYPOTHESIS": "The use of VLC technology in haptic tele-weight devices can improve the user experience in virtual shopping by providing a more immersive and realistic interaction with virtual products.", "EXPERIMENT": {"TITLE": "Validation of VLC-based Haptic Tele-Weight Device", "OBJECTIVE": "To validate the hypothesis that the use of VLC technology in haptic tele-weight devices can improve the user experience in virtual shopping.", "EQUIPMENT": "VLC tele-weight device, virtual reality headset, weight sensors, load cell, Arduino Nano, pre-equalizer circuit, post-equalizer circuit, phototransistor, motor, and a computer with virtual store software.", "STEPS": ["1. Set up the VLC tele-weight device and virtual reality headset.", "2. Create a virtual store with various products of different weights.", "3. Have participants use the VLC tele-weight device to interact with the virtual products and rate their experience.", "4. Compare the user experience ratings with a control group that uses a traditional virtual shopping interface without haptic feedback.", "5. Analyze the results to determine if the VLC-based haptic tele-weight device improves the user experience in virtual shopping."]}, "KEYWORDS": ["VLC", "Haptic Tele-Weight Device", "Virtual Reality", "E-commerce", "6G", "Internet of Things", "Embedded Systems", "Proprioceptive Haptic Sensing", "Visible Light Communication", "Smart Torch", "Haptic Interaction"], "ID": "3279e7e0c7fd3ec310d9c20c6ec29b887779fc26"}
{"TITLE": "Enhancing User Engagement in Local Energy Initiatives Using Smart Local Energy Engagement Tools: A Meta Study", "YEAR": 2023, "KEY FINDINGS": "The study examines the prevalence, effectiveness, and inclusiveness of 84 Smart Local Energy Engagement Tools (SLEETs) deployed in 72 local energy projects in the UK from 2008 to 2018. Information-driven tools were the most popular in community energy groups, while digital energy platforms or interaction tools with numeric interfaces were the most popular in smart local energy system (SLES) initiatives.", "MAIN RESULT": "Effective SLEETs stimulate engagement amongst people (social engagement), and between people and technology (operation and control), while inclusive SLEETs enable the inclusion of vulnerable and low-income households.", "HYPOTHESIS": "The deployment of SLEETs with visual interfaces can lead to higher user engagement and energy savings compared to SLEETs with numeric interfaces.", "EXPERIMENT": {"Title": "Comparing the Effectiveness of SLEETs with Visual and Numeric Interfaces", "Objective": "To investigate whether SLEETs with visual interfaces lead to higher user engagement and energy savings compared to SLEETs with numeric interfaces.", "Equipment": "Two types of SLEETs with identical functionality but different interfaces (visual and numeric), 100 participants, energy meters, and survey questionnaires.", "Steps": "1. Recruit 100 participants and randomly assign them to use either a visual or numeric SLEET for 6 months. 2. Monitor energy consumption and user engagement (e.g., frequency of logins, duration of use) for both groups. 3. Conduct surveys to assess user experience and satisfaction. 4. Compare energy savings and user engagement between the two groups."}, "KEYWORDS": ["Smart Local Energy Engagement Tools", "User Engagement", "Local Energy Initiatives", "Community Energy", "Smart Energy Systems", "Energy Efficiency", "Sustainable Development", "Energy Management", "Digital Energy Platforms", "Energy Feedback"], "ID": "33822a1fb3f914f725fcc8204c143b4147007772"}
{"TITLE": "Design Features Associated With Engagement in Mobile Health Physical Activity Interventions Among Youth: Systematic Review of Qualitative and Quantitative Studies", "YEAR": 2023, "KEY FINDINGS": "The study found that various design features, such as a clear interface, rewards, multiplayer game mode, social interaction, variety of challenges with personalized difficulty level, self-monitoring, and variety of customization options, are associated with engagement in mobile health physical activity interventions among youth.", "MAIN RESULT": "The study identified a range of design features that can contribute to engagement in mobile health physical activity interventions among youth, highlighting the importance of considering the needs and preferences of this age group in the design of such interventions.", "HYPOTHESIS": "Personalized and interactive design features that incorporate elements of gamification and social interaction can increase engagement and motivation in mobile health physical activity interventions among youth from low socioeconomic backgrounds.", "EXPERIMENT": "To validate this hypothesis, a randomized controlled trial could be conducted among a sample of youth from low socioeconomic backgrounds. Participants would be randomly assigned to one of two groups: a control group using a standard mobile health physical activity intervention, or an intervention group using a mobile health physical activity intervention with personalized and interactive design features incorporating elements of gamification and social interaction. Engagement and motivation would be measured through surveys and app usage data at baseline, 6 weeks, and 12 weeks. The experiment would require a mobile health physical activity intervention app with personalized and interactive design features, a control app without these features, and survey software. The steps to follow would be: 1) recruit participants and obtain informed consent, 2) randomly assign participants to either the control or intervention group, 3) provide participants with access to the assigned app, 4) collect survey data at baseline, 6 weeks, and 12 weeks, 5) collect app usage data throughout the 12-week period, and 6) analyze the data to compare engagement and motivation between the two groups.", "KEYWORDS": ["mobile health", "physical activity", "youth", "engagement", "design features", "gamification", "social interaction", "personalization", "low socioeconomic backgrounds", "randomized controlled trial"], "ID": "349301b8f486f735fe81fbe7c0ca0652309520f4"}
{"TITLE": "Lessons from Oz: Design Guidelines for Automotive Conversational User Interfaces", "YEAR": 2019, "KEY FINDINGS": "The paper presents a set of human-centered design guidelines for conversational user interfaces (CUIs) in the automotive domain, derived from Wizard-of-Oz studies. The guidelines aim to make interactions with an in-vehicle agent interlocutor safe, effective, engaging, and enjoyable, while conforming to users' expectations.", "MAIN RESULT": "The guidelines provide a framework for designing CUIs that can minimize cognitive demand and workload, counteract passive task-related fatigue, increase trust and acceptance, and enrich environmental engagement.", "HYPOTHESIS": "The use of a conversational agent with a clearly defined role, personality, and emotional tone can increase user trust and engagement in autonomous vehicles.", "EXPERIMENT": {"Title": "Evaluating the Effect of Conversational Agent Personality on User Trust in Autonomous Vehicles", "Equipment": "Autonomous vehicle simulator, conversational agent software, participant recruitment and survey tools", "Steps": ["Recruit participants and randomly assign them to one of two conditions: a conversational agent with a clearly defined role, personality, and emotional tone, or a neutral conversational agent.", "Have participants complete a series of tasks in the autonomous vehicle simulator, interacting with the assigned conversational agent.", "Measure participant trust and engagement through surveys and behavioral metrics (e.g., time spent interacting with the agent).", "Compare the results between the two conditions to determine if the conversational agent with a clearly defined role, personality, and emotional tone increases user trust and engagement."]}, "KEYWORDS": ["Conversational User Interfaces", "Automotive Domain", "Human-Centered Design", "Wizard-of-Oz Studies", "Autonomous Vehicles", "Trust and Acceptance", "User Experience", "Natural Language Processing", "Speech-Based Interaction", "Driver Distraction and Fatigue"], "ID": "34e1b89cc02df75a80fefd77bb0798380bd097a0"}
{"TITLE": "Exploration on Service Design of Integrated Online and Offline for the Food Nearing Its Expiration Date from the Perspective of Opposing Food Waste", "YEAR": 2024, "KEY FINDINGS": "The paper explores the service design of integrated online and offline systems to reduce food waste by promoting the sales and recycling of food nearing its expiration date. It analyzes the development background, industry status, and consumer behavior of the food nearing its expiration date industry, and proposes a comprehensive service design system that combines online and offline methods to improve sales efficiency and reduce waste.", "MAIN RESULT": "The paper provides a comprehensive service design system that integrates online and offline methods to promote the sales and recycling of food nearing its expiration date, and highlights the importance of combining online transparency and offline entity to reduce food waste.", "HYPOTHESIS": "The integration of online and offline service design can increase the sales and recycling rate of food nearing its expiration date by at least 20% compared to traditional offline-only methods.", "EXPERIMENT": {"Objective": "To validate the hypothesis that the integration of online and offline service design can increase the sales and recycling rate of food nearing its expiration date.", "Equipment": "Convenience stores with online platforms, sales data tracking software, and survey questionnaires.", "Steps": ["Select 10 convenience stores with online platforms and 10 convenience stores without online platforms as control groups.", "Implement the integrated online and offline service design system in the 10 convenience stores with online platforms.", "Track sales data and customer behavior for 6 months.", "Conduct surveys to gather customer feedback and opinions on the service design system.", "Compare the sales and recycling rate of food nearing its expiration date between the two groups and analyze the results."]}, "KEYWORDS": ["Food waste", "Expiration date", "Service design", "Online and offline integration", "Sustainability", "Consumer behavior", "Convenience stores", "Food industry", "Waste reduction", "Recycling"], "ID": "3c192badd4e675202b8a73c489319af249ddc0f1"}
{"TITLE": "PERANCANGAN USER INTERFACE DAN USER EXPERIENCE APLIKASI E-COMMERCE KAIN BATIK PADA UMKM REZTI BATIK MENGGUNAKAN PENDEKATAN DESIGN THINKING", "YEAR": 2023, "KEY FINDINGS": "The study aims to design an e-commerce application for batik fabric sales at Rezti's Batik, a small and medium-sized enterprise (SME) in Indonesia, using the design thinking approach. The application is designed to solve the problems faced by the administrator and customers in the online sales process, such as manual data management, long transaction times, and lack of transparency in the shipping process.", "MAIN RESULT": "The designed application has a good usability level, with a score of 73 for administrators and 83 for customers in the System Usability Scale (SUS) test, and excellent results in all aspects of the User Experience Questionnaire (UEQ) test.", "HYPOTHESIS": "The use of design thinking approach in designing an e-commerce application can improve the user experience and usability of the application, leading to increased customer satisfaction and loyalty.", "EXPERIMENT": "To validate this hypothesis, an experiment can be conducted as follows: 1. Recruit 20 participants, 10 administrators and 10 customers, to test the designed application. 2. Ask participants to complete a series of tasks on the application, such as searching for products, making a purchase, and tracking orders. 3. Measure the time taken to complete each task and the number of errors made. 4. Conduct a survey using the SUS and UEQ questionnaires to assess the usability and user experience of the application. 5. Compare the results with a control group that uses a traditional e-commerce application. Required equipment: Computers or mobile devices with internet access, SUS and UEQ questionnaires, and a stopwatch or timer. Steps to follow: 1) Recruit participants, 2) Brief participants on the tasks, 3) Conduct the experiment, 4) Collect and analyze data, 5) Compare results with the control group.", "KEYWORDS": ["Design Thinking", "E-commerce", "User Experience", "Usability", "Batik Fabric", "SME", "Indonesia", "System Usability Scale", "User Experience Questionnaire", "Human-Computer Interaction"], "ID": "3d4ae53d706c536ed173a249db8278a12a69f55f"}
{"TITLE": "Electronic Health Physical Activity Behavior Change Intervention to Self-Manage Cardiovascular Disease: Qualitative Exploration of Patient and Health Professional Requirements", "YEAR": 2018, "KEY FINDINGS": "The study explored the requirements of patients and health professionals for a home-based cardiac rehabilitation program, PATHway, and identified key themes related to capability, opportunity, motivation, and behavior. Patients expressed concerns about their physical and psychological capability to engage with physical activity, and highlighted the need for education and support to enhance their capability. Health professionals emphasized the importance of a patient-centered approach and the need for a multifaceted intervention that addresses the complexities of cardiovascular disease management.", "MAIN RESULT": "The study identified the need for a patient-centered, multifaceted intervention that addresses the complexities of cardiovascular disease management and provides education and support to enhance patients' capability and motivation to engage in physical activity.", "HYPOTHESIS": "A patient-centered, multifaceted intervention that provides education and support to enhance patients' capability and motivation to engage in physical activity will lead to increased adherence to cardiac rehabilitation programs and improved health outcomes for patients with cardiovascular disease.", "EXPERIMENT": "A randomized controlled trial to compare the effectiveness of a patient-centered, multifaceted intervention (PATHway) with a standard cardiac rehabilitation program. Participants will be randomly assigned to either the PATHway group or the standard care group. The PATHway group will receive a 12-week home-based cardiac rehabilitation program that includes education and support to enhance capability and motivation, while the standard care group will receive a traditional hospital-based cardiac rehabilitation program. Adherence to the program, physical activity levels, and health outcomes will be measured at baseline, 12 weeks, and 6 months. Required equipment: wearable sensors (e.g. heart rate monitors), mobile devices, and software for data collection and analysis.", "KEYWORDS": ["cardiovascular disease", "cardiac rehabilitation", "physical activity", "behavior change", "patient-centered care", "multifaceted intervention", "home-based intervention", "health technology", "eHealth", "telemedicine"], "ID": "3f1642bcb8dd0a3130904989bd63c63ef0915bbc"}
{"TITLE": "PENGEMBANGAN MODEL INSTRUMEN PENGUKURAN CUSTOMER INTERFACE 8C", "YEAR": 2018, "KEY FINDINGS": "The study develops a measurement model of customer interface using 8C (context, content, community, customization, communication, connection, commerce, and collaboration) for e-commerce websites, particularly from the visitor's perspective. The model consists of 16 items grouped into 8 dimensions.", "MAIN RESULT": "The implementation of the customer interface 8C model on 5 e-commerce websites in Pontianak, Indonesia, shows that the websites have good customer interface, with Database Komputer having the highest score.", "HYPOTHESIS": "Improving the customer interface of an e-commerce website using the 8C model will increase customer loyalty and retention.", "EXPERIMENT": {"Title": "Evaluating the Effect of 8C Customer Interface on Customer Loyalty", "Objective": "To investigate the impact of improving the customer interface of an e-commerce website using the 8C model on customer loyalty and retention.", "Equipment": "E-commerce website, 8C customer interface model, survey questionnaire, statistical analysis software", "Steps": ["1. Select an e-commerce website and implement the 8C customer interface model.", "2. Recruit participants and ask them to use the website for a certain period.", "3. Administer a survey questionnaire to measure customer loyalty and retention before and after the implementation of the 8C model.", "4. Analyze the data using statistical analysis software to compare the results before and after the implementation of the 8C model.", "5. Compare the results with a control group that did not receive the 8C model implementation."]}, "KEYWORDS": ["Customer Interface", "E-commerce", "8C Model", "Context", "Content", "Community", "Customization", "Communication", "Connection", "Commerce", "Collaboration", "Customer Loyalty", "Retention"], "ID": "3f3dc8f66f28980c197e3f4475f37219dd99f03d"}
{"TITLE": "Assessment of Applicability of the Service Design Method on Electric Vehicles", "YEAR": 2020, "KEY FINDINGS": "The study found that the main reason for purchasing an electric vehicle (EV) is prestige, not environmental concerns or features like range or performance. The online communication of producers does not align with the expectations of users, and the importance of sustainability is not a key factor in the purchasing decision.", "MAIN RESULT": "The study highlights the need for a service design approach that focuses on the user experience and privilege issues, rather than solely on environmental benefits.", "HYPOTHESIS": "The prestige factor in EV purchasing decisions can be increased by emphasizing the exclusive and modern image of EVs in marketing campaigns.", "EXPERIMENT": {"Title": "Prestige-focused Marketing Campaign Experiment", "Objective": "To investigate the effect of prestige-focused marketing campaigns on EV purchasing decisions.", "Equipment": "Online survey platform, social media advertising tools, EV marketing materials.", "Steps": ["1. Design two sets of marketing materials for EVs: one emphasizing environmental benefits and one emphasizing prestige and exclusivity.", "2. Recruit 100 participants and randomly assign them to one of the two marketing material groups.", "3. Ask participants to complete an online survey assessing their attitudes towards EVs and their likelihood of purchasing an EV.", "4. Analyze the results to compare the effect of the two marketing approaches on EV purchasing decisions."]}, "KEYWORDS": ["Service design", "Electric vehicles", "Prestige", "Sustainability", "Marketing campaigns", "User experience", "Environmental benefits", "Exclusive image", "Modern image", "Purchasing decisions"], "ID": "3ffb1edcccfd12acdc3e3c44a61457f498b33d19"}
{"TITLE": "Designing User Experience and User Interface of a B2B Textile e-Commerce using Five Planes Framework", "YEAR": 2020, "KEY FINDINGS": "The paper presents a design of a B2B textile e-commerce platform using the five planes framework, which consists of strategy, scope, structure, skeleton, and surface planes. The design aims to improve connectivity between textile industries in Indonesia.", "MAIN RESULT": "The output of the study is the design of the textile e-commerce interface on the alpha version of the website, which includes features such as product categorization, search functionality, and content management system.", "HYPOTHESIS": "The use of the five planes framework in designing a B2B e-commerce platform can improve the user experience and increase the adoption rate of the platform among textile industries.", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of the Five Planes Framework in B2B E-commerce Design", "OBJECTIVE": "To validate the hypothesis that the use of the five planes framework in designing a B2B e-commerce platform can improve the user experience and increase the adoption rate of the platform among textile industries.", "REQUIRED EQUIPMENT": "A functional prototype of the B2B textile e-commerce platform designed using the five planes framework, a control group platform designed using a different methodology, and a survey questionnaire.", "STEPS TO FOLLOW": ["Recruit 100 textile industry professionals and divide them into two groups: one group will use the platform designed using the five planes framework, and the other group will use the control group platform.", "Ask participants to complete a series of tasks on the platform, such as searching for products, placing orders, and managing inventory.", "Administer a survey questionnaire to participants to gather feedback on their user experience, including usability, satisfaction, and intention to use the platform.", "Compare the results of the two groups to determine if the platform designed using the five planes framework performs better in terms of user experience and adoption rate."]}, "KEYWORDS": ["B2B e-commerce", "Textile industry", "User experience", "User interface", "Five planes framework", "E-commerce design", "Strategy plane", "Scope plane", "Structure plane", "Skeleton plane", "Surface plane"], "ID": "42fc81567cd4735319005745c1bac6577ee546f3"}
{"TITLE": "Importance-performance and potential gain of food delivery apps: in view of the restaurant partner perspective", "YEAR": 2024, "KEY FINDINGS": "The study evaluates the importance-performance of food delivery apps (FDAs) from the perspective of restaurant partners and identifies strategies to maximize potential gains. The results show that owning customer data, revenue sharing, and competitive advantage are the most potential gains from joining FDAs.", "MAIN RESULT": "The study provides a clear and measurable direction for future research to develop FDA performance and establishes a proper theoretical basis for subsequent research.", "HYPOTHESIS": "Restaurant partners' satisfaction with FDAs is positively correlated with the perceived value of owning customer data, revenue sharing, and competitive advantage.", "EXPERIMENT": {"Objective": "To validate the hypothesis that restaurant partners' satisfaction with FDAs is positively correlated with the perceived value of owning customer data, revenue sharing, and competitive advantage.", "Design": "Survey research design", "Participants": "200 restaurant partners who use FDAs", "Equipment": "Online survey platform, questionnaire", "Steps": ["Develop a questionnaire to measure restaurant partners' satisfaction with FDAs and their perceived value of owning customer data, revenue sharing, and competitive advantage.", "Distribute the questionnaire to 200 restaurant partners who use FDAs.", "Collect and analyze the data using statistical software.", "Correlate the satisfaction scores with the perceived value scores to test the hypothesis."]}, "KEYWORDS": ["Food delivery apps", "Restaurant partners", "Satisfaction", "Importance-performance analysis", "Potential gain", "Customer data", "Revenue sharing", "Competitive advantage", "Online food delivery", "Digitalization"], "ID": "46820d643bc2e8c3cad8a1df0dc0d78e1ee0a35a"}
{"TITLE": "Multi-Chatbot or Single-Chatbot? The Effects of M-Commerce Chatbot Interface on Source Credibility, Social Presence, Trust, and Purchase Intention", "YEAR": 2022, "KEY FINDINGS": "The study found that a single-chatbot interface led to higher social presence and trusting beliefs toward the m-commerce platform than a multi-chatbot interface. Males attributed the chatbot with higher competence and reported higher purchase intention through the m-commerce platform when engaging with the single-chatbot interface than the multi-chatbot interface.", "MAIN RESULT": "The single-chatbot interface outperformed the multi-chatbot interface in terms of social presence, trust, and purchase intention.", "HYPOTHESIS": "Designating chatbots as product-specific advisers in a multi-chatbot interface without labels to accentuate expertise may not evoke users to categorize them as product specialists, leading to lower trust and purchase intention.", "EXPERIMENT": {"Title": "Evaluating the Effect of Labeling on Trust and Purchase Intention in Multi-Chatbot Interfaces", "Equipment": "Computer with internet access, survey software, and a multi-chatbot interface with and without labels", "Steps": ["Recruit participants and randomly assign them to either a multi-chatbot interface with labels or without labels.", "Ask participants to interact with the assigned interface and complete a survey measuring trust, social presence, and purchase intention.", "Compare the results between the two groups to determine if labeling chatbots as product-specific advisers increases trust and purchase intention."]}, "KEYWORDS": ["Chatbot", "M-Commerce", "Source Credibility", "Social Presence", "Trust", "Purchase Intention", "Multi-Chatbot Interface", "Single-Chatbot Interface", "Product-Specific Advisers", "Labeling Effect"], "ID": "4b8cfe563f779056335ffb34ea7ed1fedb968e66"}
{"TITLE": "Dimensional Evolution of Intelligent Cars Human-Machine Interface considering Take-Over Performance and Drivers’ Perception on Urban Roads", "YEAR": 2020, "KEY FINDINGS": "The study analyzed the drivers' take-over behaviors in intelligent cars when driving on urban roads and tried to find reasonable dimensions of the human-machine interface. The results indicated that the completion time of most take-over tasks under the HMI with the evolved dimensions was significantly shorter, which ensured the HMI could be more conducive to the take-over quality and traffic efficiency.", "MAIN RESULT": "The study found that the evolved dimensions of the human-machine interface led to shorter completion times and improved take-over quality.", "HYPOTHESIS": "The optimal dimensions of the human-machine interface can be evolved based on drivers' perceptual judgment and preference, leading to improved take-over performance and traffic efficiency.", "EXPERIMENT": {"TITLE": "Validation of Evolved Dimensions on Take-Over Performance", "EQUIPMENT": "Driving simulator, 3D printer, and laptop", "STEPS": ["1. Recruit 13 subjects and ask them to complete take-over tasks on a driving simulator with the original HMI.", "2. Collect the completion time and error times of the subjects during the seven take-over tasks.", "3. Use the collected data to evolve the optimal dimensions of the HMI using genetic algorithm.", "4. Create new models of the side stalk and buttons with the evolved dimensions using a 3D printer.", "5. Ask the same subjects to complete the same take-over tasks on the driving simulator with the new HMI.", "6. Compare the completion time and error times of the subjects between the original and new HMI."]}, "KEYWORDS": ["Intelligent cars", "Human-machine interface", "Take-over performance", "Drivers' perception", "Urban roads", "Genetic algorithm", "Driving simulator", "Ergonomics", "Automated driving", "Traffic efficiency"], "ID": "4efb078bcb1b2883ae4a3b76a91441a38347d545"}
{"TITLE": "Development of a Revenue Model for Buyers in Co-Creation Environment", "YEAR": 2020, "KEY FINDINGS": "The paper discusses the concept of co-creation and its application in mobile devices and social networking services (SNS) environment. It suggests a buyer revenue model based on the scenario where customers create value through their experiences and interactions with companies.", "MAIN RESULT": "The paper proposes a platform for co-creation that enables customers and companies to interact and create value together, and suggests that this platform should be an open structure that connects all stakeholders, including companies, customers, providers, and distributors.", "HYPOTHESIS": "The more customers are involved in the co-creation process, the more likely they are to purchase products or services from the company.", "EXPERIMENT": {"TITLE": "Co-Creation and Purchase Intention Experiment", "OBJECTIVE": "To investigate the relationship between customer involvement in co-creation and purchase intention.", "METHODS": "Recruit 100 participants and randomly assign them to one of two groups: a high-involvement group and a low-involvement group. The high-involvement group will be asked to participate in a co-creation activity, such as designing a product, while the low-involvement group will only be asked to provide feedback on a pre-designed product. After the activity, measure the participants' purchase intention using a survey. Compare the results between the two groups.", "EQUIPMENT": "Computers or mobile devices with internet access, survey software, and product design tools.", "STEPS": "1. Recruit participants and assign them to groups. 2. Conduct the co-creation activity or feedback session. 3. Administer the survey to measure purchase intention. 4. Analyze the results and compare between groups."}, "KEYWORDS": ["co-creation", "revenue model", "mobile devices", "social networking services", "buyer behavior", "purchase intention", "customer involvement", "value creation", "business model", "innovation"], "ID": "53ae4453e81043338115df461edd41152e3fb1cb"}
{"TITLE": "Evaluating and Ranking the Energy Performance of E-Commerce Development Strategies Using TOPSIS Method", "YEAR": 2023, "KEY FINDINGS": "The paper discusses the importance of e-commerce development strategies in today's digital age and highlights the need for companies to adapt and refine their strategies to stay ahead in the competitive market. It also emphasizes the role of TOPSIS method in evaluating and ranking the energy performance of e-commerce development strategies.", "MAIN RESULT": "The paper proposes the use of TOPSIS method as a decision-making tool to evaluate and rank e-commerce development strategies based on various criteria such as feasibility, implementation speed, compliance with corporate strategy, and customer acceptance.", "HYPOTHESIS": "The use of TOPSIS method can significantly improve the energy performance of e-commerce development strategies by identifying the most effective strategies that meet the criteria of feasibility, implementation speed, compliance with corporate strategy, and customer acceptance.", "EXPERIMENT": "To validate the hypothesis, an experiment can be designed as follows: Equipment required: * A dataset of e-commerce development strategies * TOPSIS software or programming language (e.g. Python) * Criteria weights for feasibility, implementation speed, compliance with corporate strategy, and customer acceptance Steps to follow: 1. Collect a dataset of e-commerce development strategies from various companies. 2. Determine the criteria weights for feasibility, implementation speed, compliance with corporate strategy, and customer acceptance based on expert opinions or literature review. 3. Use TOPSIS software or programming language to evaluate and rank the e-commerce development strategies based on the criteria weights. 4. Analyze the results to identify the top-ranked strategies that meet the criteria of feasibility, implementation speed, compliance with corporate strategy, and customer acceptance. 5. Compare the results with the actual performance of the companies that implemented the top-ranked strategies to validate the effectiveness of the TOPSIS method.", "KEYWORDS": ["E-commerce development strategies", "TOPSIS method", "Energy performance", "Decision-making", "Feasibility", "Implementation speed", "Compliance with corporate strategy", "Customer acceptance", "Digital marketing", "Business strategy"], "ID": "56b71b459b9ac7ddb45ca3ab0255e52acc48c822"}
{"TITLE": "An Analysis of Post COVID-19 Scenario using Data Science in Digital Marketing", "YEAR": 2022, "KEY FINDINGS": "The study identifies 17 uses of data science in digital marketing, including analyzing user-generated content, tracking social media commentary/interactions, and optimizing customers' preferences. The study also develops a structural model using Interpretive Structural Modeling (ISM) and Matriced' Impacts Croise's Multiplication Appliquée a UN Classement (MICMAC) to analyze the relationships between these uses.", "MAIN RESULT": "The study provides a framework for understanding the uses of data science in digital marketing and their relationships, which can help businesses and marketers to prioritize their efforts and make informed decisions.", "HYPOTHESIS": "The effective use of data science in digital marketing can lead to improved customer engagement and increased sales during the post-COVID-19 era.", "EXPERIMENT": {"TITLE": "The Impact of Data Science on Customer Engagement in Digital Marketing", "OBJECTIVE": "To investigate the effect of data science on customer engagement in digital marketing during the post-COVID-19 era.", "METHODS": ["Recruit 100 participants and randomly assign them to two groups: a control group and a treatment group.", "The control group will receive traditional digital marketing messages, while the treatment group will receive personalized messages based on data science analysis.", "Measure customer engagement metrics, such as click-through rates, conversion rates, and customer satisfaction, for both groups.", "Compare the results between the two groups to determine the effect of data science on customer engagement."], "EQUIPMENT": ["Computer with internet access", "Data science software (e.g. Python, R, or Excel)", "Digital marketing platform (e.g. social media, email marketing software)"]}, "KEYWORDS": ["Data Science", "Digital Marketing", "Post-COVID-19 Era", "Customer Engagement", "ISM", "MICMAC", "Personalization", "Marketing Strategy", "Business Analytics", "Digital Transformation"], "ID": "59cc8c3f7e3890d8e89616af6c2d061ce1ce77fa"}
{"TITLE": "Reimagining m-Commerce App Design: The Development of Seductive Marketing through UX", "YEAR": 2016, "KEY FINDINGS": "The paper highlights the need for a shift in m-commerce app design to focus on seductive marketing and user experience, rather than just presenting products. It proposes a UX Design Paradigm Framework that considers brand communication, sales focus, seductive interaction, and passive presentation.", "MAIN RESULT": "The analysis of 22 popular fashion m-commerce apps reveals that most apps focus on direct sales rather than brand communication, and that there is a lack of seductive interaction and passive presentation in current app designs.", "HYPOTHESIS": "Incorporating seductive interaction and passive presentation elements in m-commerce apps can increase user engagement and ultimately lead to higher sales and brand loyalty.", "EXPERIMENT": {"Title": "Seductive Interaction in m-Commerce Apps", "Objective": "To investigate the effect of seductive interaction and passive presentation on user engagement and sales in m-commerce apps.", "Equipment": "Mobile devices with m-commerce apps, eye-tracking software, and survey questionnaires.", "Steps": ["1. Develop two versions of an m-commerce app: one with seductive interaction and passive presentation elements, and one without.", "2. Recruit 100 participants and randomly assign them to use either the seductive app or the non-seductive app.", "3. Use eye-tracking software to track user engagement and interaction with the app.", "4. Administer survey questionnaires to participants to gather data on their perceived brand loyalty and likelihood to make a purchase.", "5. Compare the results between the two groups to determine the effect of seductive interaction and passive presentation on user engagement and sales."]}, "KEYWORDS": ["m-Commerce", "UX Design", "Seductive Marketing", "Brand Communication", "Sales Focus", "Seductive Interaction", "Passive Presentation", "Mobile Apps", "Retail", "E-commerce", "User Experience"], "ID": "63c92252adee2361ceba88dcd426d31ca303d774"}
{"TITLE": "How Explainable Machine Learning Enhances Intelligence in Explaining Consumer Purchase Behavior: A Random Forest Model with Anchoring Effects", "YEAR": 2023, "KEY FINDINGS": "The study proposes a random forest model to analyze consumer purchase behavior in search advertising, considering the influence of anchoring effects on rational consumer behavior. The model identifies significant indicators and reveals key factors influencing consumer purchase behavior and their relative importance.", "MAIN RESULT": "The explainable machine learning model based on the random forest algorithm performed optimally, making it suitable for analyzing and predicting consumer purchase behavior.", "HYPOTHESIS": "The anchoring effect of product information on consumer purchase behavior can be mitigated by providing consumers with more detailed and informative product information.", "EXPERIMENT": {"Objective": "To validate the hypothesis that providing consumers with more detailed and informative product information can mitigate the anchoring effect on consumer purchase behavior.", "Equipment": "Online survey platform, product information datasets with varying levels of detail and informativeness, and a sample of participants with diverse demographic backgrounds.", "Steps": ["Recruit participants and randomly assign them to one of two groups: a control group and a treatment group.", "Present participants in the control group with product information with low levels of detail and informativeness, and participants in the treatment group with product information with high levels of detail and informativeness.", "Measure participants' purchase intentions and anchoring effects using surveys and behavioral data.", "Compare the results between the control and treatment groups to determine if providing more detailed and informative product information mitigates the anchoring effect on consumer purchase behavior."]}, "KEYWORDS": ["Explainable Machine Learning", "Consumer Purchase Behavior", "Anchoring Effects", "Search Advertising", "Random Forest Model", "Product Information", "Merchant Information", "SHAP Explainable Framework", "E-commerce", "Marketing Strategies"], "ID": "6485cd9b1a0127ff4e896aba251ba5d654345283"}
{"TITLE": "REFINEMENT OF COLLEGE WEBSITE - GCOEC", "YEAR": 2024, "KEY FINDINGS": "The paper presents a comprehensive examination of strategies employed to optimize college website infrastructure, with a particular emphasis on the implementation of personalized databases and the enhancement of user interface and user experience (UI/UX) design using the MERN stack.", "MAIN RESULT": "The refinement of the college website using the MERN stack has resulted in a modern, scalable, and robust platform that meets the evolving needs of both students and faculty.", "HYPOTHESIS": "The use of the MERN stack in college website development can lead to significant improvements in user experience, scalability, and maintainability compared to traditional web development frameworks.", "EXPERIMENT": {"TITLE": "Comparative Analysis of MERN Stack and Traditional Web Development Frameworks", "OBJECTIVE": "To compare the performance, scalability, and user experience of a college website developed using the MERN stack with a website developed using traditional web development frameworks.", "EQUIPMENT": "Two identical college websites, one developed using the MERN stack and the other using traditional web development frameworks, a load testing tool, and a user experience survey tool.", "STEPS": ["Develop two identical college websites, one using the MERN stack and the other using traditional web development frameworks.", "Conduct load testing on both websites to measure performance and scalability.", "Conduct user experience surveys to measure user satisfaction and engagement.", "Compare the results of the load testing and user experience surveys to determine the effectiveness of the MERN stack in improving user experience, scalability, and maintainability."]}, "KEYWORDS": ["College Website", "MERN Stack", "User Experience", "Scalability", "Maintainability", "Web Development", "MongoDB", "Express.js", "React.js", "Node.js"], "ID": "64c0881b338bd32c4becf701bcb36fd9e3c69c6d"}
{"TITLE": "Consumer Perspectives on Maternal and Infant Health Apps: Qualitative Content Analysis", "YEAR": 2021, "KEY FINDINGS": "The study analyzed 2422 user reviews of 75 maternal and infant health apps and found that users value apps that are low-cost, have high-quality content, superior features, and user-friendly interfaces. Users also appreciate apps that offer social support and have responsive customer care support.", "MAIN RESULT": "The study identified three major themes: app functionality, technical aspects, and app content, and six minor themes: patterns of use, social support, app cost, app comparisons, assistance in health care, and customer care support.", "HYPOTHESIS": "Users who use maternal and infant health apps that offer social support and responsive customer care support are more likely to continue using the app and have better health outcomes.", "EXPERIMENT": {"Title": "The Effect of Social Support and Customer Care Support on Maternal and Infant Health App Engagement", "Objective": "To investigate the effect of social support and customer care support on maternal and infant health app engagement and health outcomes.", "Design": "Randomized controlled trial", "Participants": "100 pregnant women or new mothers", "Intervention": "Participants will be randomly assigned to one of two groups: a control group that uses a standard maternal and infant health app, and an intervention group that uses an app with enhanced social support and customer care support features.", "Outcome Measures": "App engagement (e.g., frequency of use, duration of use), health outcomes (e.g., birth weight, breastfeeding rates), and user satisfaction.", "Equipment": "Smartphones, maternal and infant health apps with social support and customer care support features, and data analysis software.", "Steps": "1. Recruit participants and randomly assign them to either the control or intervention group. 2. Provide participants with the assigned app and instruct them on how to use it. 3. Collect data on app engagement and health outcomes at 3, 6, and 12 months postpartum. 4. Analyze data using statistical software and compare outcomes between the control and intervention groups."}, "KEYWORDS": ["mHealth", "maternal and infant health", "mobile applications", "smartphones", "health education", "decision-making support", "user engagement", "social support", "customer care support", "health outcomes"], "ID": "64ce3db7bf7a44a24707b63551b06515ac198903"}
{"TITLE": "Relationship between E-Commerce Strategies and Customer Loyalty among Multinational Enterprises in Kenya: A Case of Jumia", "YEAR": 2023, "KEY FINDINGS": "The study found a statistically significant positive relationship between e-marketing, e-service quality, and e-trust on customer loyalty among Multinational Enterprises in Kenya.", "MAIN RESULT": "The study recommends that Jumia should invest more in personalized and targeted marketing strategies, focus on enhancing their website and mobile app interfaces, and prioritize building trust with their customers by ensuring the security of their personal and financial information.", "HYPOTHESIS": "Personalized and targeted marketing strategies can increase customer loyalty among Multinational Enterprises in Kenya.", "EXPERIMENT": {"Title": "Personalized Marketing Strategies and Customer Loyalty", "Objective": "To investigate the effect of personalized and targeted marketing strategies on customer loyalty among Multinational Enterprises in Kenya.", "Equipment": "Survey questionnaires, online survey platform, and statistical analysis software.", "Steps": ["Recruit 300 participants who are customers of Jumia Kenya.", "Randomly assign participants to either a control group or an experimental group.", "The control group will receive standard marketing messages, while the experimental group will receive personalized and targeted marketing messages.", "Measure customer loyalty using a survey questionnaire after 6 weeks.", "Compare the customer loyalty scores between the control and experimental groups using statistical analysis software."]}, "KEYWORDS": ["E-commerce", "Customer Loyalty", "Multinational Enterprises", "Kenya", "E-marketing", "E-service Quality", "E-trust", "Personalized Marketing", "Targeted Marketing", "Jumia"], "ID": "69b31dfd84c773d0126308a4244f8d879576808c"}
{"TITLE": "E-commerce Website Performance Evaluation: Technology, Strategy and Metrics", "YEAR": 2024, "KEY FINDINGS": "The paper discusses the importance of e-commerce websites and online marketplaces, highlighting their benefits such as global audience access, accessibility, cost-effectiveness, and diversification. It also presents a strategic framework for building an e-commerce website using the MERN stack (MongoDB, Express.js, React, and Node.js) and evaluates its performance using metrics such as Largest Contentful Paint, First Input Delay, and Cumulative Layout Shift.", "MAIN RESULT": "The paper provides a comprehensive guide for building and evaluating the performance of an e-commerce website, highlighting the importance of considering factors such as technology stack, architecture, and metrics.", "HYPOTHESIS": "The use of a MERN stack-based e-commerce website can improve the user experience and conversion rates compared to traditional e-commerce platforms.", "EXPERIMENT": {"Objective": "To compare the user experience and conversion rates of a MERN stack-based e-commerce website with a traditional e-commerce platform.", "Equipment": "Two identical e-commerce websites, one built using the MERN stack and the other using a traditional platform, user experience testing software, and analytics tools.", "Steps": ["1. Develop two identical e-commerce websites, one using the MERN stack and the other using a traditional platform.", "2. Recruit a group of users to test both websites and provide feedback on user experience.", "3. Use user experience testing software to collect data on metrics such as page load time, navigation, and search functionality.", "4. Analyze the data to compare the user experience of both websites.", "5. Use analytics tools to track conversion rates and sales for both websites.", "6. Compare the results to determine if the MERN stack-based website outperforms the traditional platform."]}, "KEYWORDS": ["E-commerce", "Online marketplace", "MERN stack", "User experience", "Conversion rates", "Performance evaluation", "Technology stack", "Architecture", "Metrics", "Web development"], "ID": "6a14881b62fc58a58e8fee49ef7fb682d07ca4c0"}
{"TITLE": "Embodied Conversational Agents Providing Motivational Interviewing to Improve Health-Related Behaviors: Scoping Review", "YEAR": 2023, "KEY FINDINGS": "The review found that embodied conversational agents (ECAs) have been used to deliver motivational interviewing (MI) interventions for various health-related behaviors, including reducing alcohol use, promoting physical activity, and improving diet. The ECAs used in these interventions were primarily female, used rules-driven dialogue mechanisms, and included emotional behavior to convey empathy. However, the review highlighted the need for more in-depth exploration of ECA characteristics and the integration of MI principles, processes, and techniques into ECAs.", "MAIN RESULT": "The review identified 14 studies that used ECAs to deliver MI interventions, with most studies reporting positive results regarding acceptability, usability, and user experience.", "HYPOTHESIS": "The use of ECAs that incorporate emotional intelligence and empathy will lead to more effective MI interventions and improved health-related behaviors compared to ECAs that do not incorporate these features.", "EXPERIMENT": "To validate this hypothesis, a randomized controlled trial could be conducted to compare the effectiveness of two ECAs: one that incorporates emotional intelligence and empathy, and one that does not. The experiment would require: * 100 participants with a specific health-related behavior (e.g. physical inactivity) * Two ECAs: one with emotional intelligence and empathy, and one without * A motivational interviewing intervention delivered through each ECA * Measures of acceptability, usability, and user experience * Measures of health-related behavior change (e.g. physical activity levels) The experiment would involve randomly assigning participants to either the ECA with emotional intelligence and empathy or the ECA without. Both ECAs would deliver the same MI intervention, and participants would interact with the ECA for a set period of time. The outcome measures would be compared between the two groups to determine if the ECA with emotional intelligence and empathy is more effective in promoting health-related behavior change.", "KEYWORDS": ["embodied conversational agents", "motivational interviewing", "health-related behaviors", "emotional intelligence", "empathy", "randomized controlled trial", "physical activity", "diet", "alcohol use", "digital health interventions"], "ID": "6d30c65ca4677cd28cc99974d5f2a6d2f6175e6a"}
{"TITLE": "WYDISWYG: A Method to Design User Interfaces Combining Design Principles and Quality Factors", "YEAR": 2023, "KEY FINDINGS": "The study proposes a method to design e-commerce user interfaces with varying levels of aesthetics and usability while maintaining a similar level of user design perception. The results show that usability is more crucial than aesthetics in enhancing user experience.", "MAIN RESULT": "The experiment demonstrated that it is possible to design user interfaces with varying levels of aesthetics and usability while maintaining a similar level of user design perception.", "HYPOTHESIS": "Designing e-commerce user interfaces with a balance of aesthetics and usability can lead to a higher level of user satisfaction and engagement.", "EXPERIMENT": {"TITLE": "Validating the WYDISWYG Hypothesis", "OBJECTIVE": "To validate the hypothesis that designing e-commerce user interfaces with a balance of aesthetics and usability can lead to a higher level of user satisfaction and engagement.", "EQUIPMENT": "40 participants, 4 e-commerce websites with varying levels of aesthetics and usability, survey questionnaire, and user interaction tracking software.", "STEPS": ["Recruit 40 participants and divide them into 4 groups.", "Ask each group to interact with one of the 4 e-commerce websites with varying levels of aesthetics and usability.", "Administer a survey questionnaire to measure user satisfaction and engagement.", "Track user interaction using software to measure usability metrics such as time on task and error rate.", "Compare the results across the 4 groups to determine if the website with a balance of aesthetics and usability leads to higher user satisfaction and engagement."]}, "KEYWORDS": ["user interface design", "aesthetics", "usability", "e-commerce", "user experience", "WYDISWYG", "design principles", "quality factors", "user satisfaction", "engagement"], "ID": "6d886859d9bac66a2de81f857f3c6f5aee8204d2"}
{"TITLE": "Understanding the Factors Influencing Customer Engagement in Online Grocery Shopping: A Multi-dimensional Approach", "YEAR": 2023, "KEY FINDINGS": "The study identifies seven key factors that influence customer engagement in online grocery shopping, including user experience and interface design, personalization and customization, trust and security measures, product information and reviews, convenience and delivery options, promotions and loyalty programs, and social interactions and community building.", "MAIN RESULT": "The research highlights the significance of customer engagement in online grocery shopping and its impact on consumer behavior, including increased purchase frequency, higher average order value, brand loyalty and advocacy, reduced price sensitivity, and lower churn rate.", "HYPOTHESIS": "Personalization and customization options in online grocery shopping platforms can increase customer engagement and loyalty by 20% compared to platforms without such features.", "EXPERIMENT": {"Title": "Personalization and Customization in Online Grocery Shopping", "Objective": "To investigate the effect of personalization and customization options on customer engagement and loyalty in online grocery shopping.", "Equipment": "Online grocery shopping platform with personalization and customization features, survey software, and data analysis tools.", "Steps": ["Recruit 100 participants and randomly assign them to either a control group or an experimental group.", "Provide the control group with a standard online grocery shopping experience without personalization and customization options.", "Provide the experimental group with an online grocery shopping experience with personalization and customization options, such as tailored product recommendations and shopping lists.", "Measure customer engagement and loyalty through surveys and behavioral data, such as purchase frequency and average order value, over a period of 6 weeks.", "Compare the results between the control and experimental groups to determine the effect of personalization and customization on customer engagement and loyalty."]}, "KEYWORDS": ["online grocery shopping", "customer engagement", "user experience", "personalization", "customization", "trust", "security", "convenience", "promotions", "loyalty programs", "social interactions"], "ID": "72a09f05bab032f5ff7e217910981393c84bd738"}
{"TITLE": "Designing UI/UX of Mobile-Based Men's Fashion Product Application at Celcius Store in Manado City Using Design Thinking", "YEAR": 2023, "KEY FINDINGS": "The study found that the current online shopping experience of Celcius store is inconvenient for customers, with issues such as manual typing of product information and lack of product stock information. The study also found that customers prefer a mobile application with a user-friendly interface and easy navigation.", "MAIN RESULT": "The study resulted in the design of a mobile-based men's fashion product application with a user-friendly interface and easy navigation, which was tested and validated by 10 respondents using the System Usability Scale (SUS) and Single Ease Question (SEQ) methods.", "HYPOTHESIS": "The use of Design Thinking in designing a mobile-based application can improve the online shopping experience of customers and increase customer satisfaction.", "EXPERIMENT": {"TITLE": "Validation of Design Thinking in Mobile-Based Application Design", "OBJECTIVE": "To validate the hypothesis that the use of Design Thinking in designing a mobile-based application can improve the online shopping experience of customers and increase customer satisfaction.", "REQUIRED EQUIPMENT": "Mobile devices with the designed application, SUS and SEQ questionnaires, and a sample of 100 customers.", "STEPS TO FOLLOW": ["1. Recruit 100 customers and divide them into two groups: a control group and an experimental group.", "2. Provide the control group with the current online shopping experience of Celcius store.", "3. Provide the experimental group with the designed mobile-based application.", "4. Ask both groups to complete a task of purchasing a product online.", "5. Administer the SUS and SEQ questionnaires to both groups after completing the task.", "6. Compare the results of the SUS and SEQ questionnaires between the two groups.", "7. Analyze the results to determine if the designed mobile-based application improves the online shopping experience of customers and increases customer satisfaction."]}, "KEYWORDS": ["Design Thinking", "Mobile-Based Application", "UI/UX Design", "Online Shopping Experience", "Customer Satisfaction", "System Usability Scale (SUS)", "Single Ease Question (SEQ)", "Men's Fashion Products", "E-commerce", "Mobile Devices"], "ID": "74bd19ad5061c9c7d0fc8b0d51d9f34b273564fa"}
{"TITLE": "Realidades Extendidas: El futuro de la enseñanza y el aprendizaje interactivo", "YEAR": 2024, "KEY FINDINGS": "The study explores the impact of Extended Realities (XR) technologies on education, highlighting their potential to increase information retention and student engagement. The results show a significant improvement in information retention and student engagement after XR sessions.", "MAIN RESULT": "The study demonstrates the transformative potential of XR in education, emphasizing the importance of addressing practical barriers to their effective implementation.", "HYPOTHESIS": "XR technologies can increase student motivation and engagement in learning by providing immersive and interactive experiences that simulate real-world situations.", "EXPERIMENT": {"Title": "XR-based Learning Experience", "Objective": "To investigate the effect of XR-based learning experiences on student motivation and engagement.", "Equipment": "XR headsets, computers, and educational software", "Steps": ["Recruit 100 students and randomly assign them to either an XR-based learning group or a traditional learning group.", "Design an XR-based learning experience that simulates a real-world situation relevant to the subject matter.", "Administer a pre-test to assess students' motivation and engagement levels.", "Have students in the XR-based learning group participate in the XR-based learning experience, while students in the traditional learning group receive traditional instruction.", "Administer a post-test to assess students' motivation and engagement levels.", "Compare the results of the pre-test and post-test to determine the effect of XR-based learning experiences on student motivation and engagement."]}, "KEYWORDS": ["Extended Realities", "Education", "Virtual Reality", "Augmented Reality", "Interactive Learning", "Educational Technology", "Student Engagement", "Motivation", "Immersive Learning", "Simulated Learning Experiences"], "ID": "74e9881de6aec5f2579198e0f6ac444c3532a318"}
{"TITLE": "The National Sleep Research Resource: towards a sleep data commons", "YEAR": 2018, "KEY FINDINGS": "The National Sleep Research Resource (NSRR) is a comprehensive system for sharing sleep data, which embodies elements of a data commons aimed at accelerating research to address critical questions about the impact of sleep disorders on important health outcomes.", "MAIN RESULT": "The NSRR contains semantically annotated data from 26,808 subjects, and 51,435 linked files of raw or processed signals, including 31,166 EDF files that are available for downloading.", "HYPOTHESIS": "The integration of sleep data from multiple sources into a single platform can facilitate the discovery of novel relationships between sleep patterns and health outcomes.", "EXPERIMENT": {"TITLE": "Investigating the relationship between sleep patterns and cardiovascular disease", "OBJECTIVE": "To identify novel sleep patterns associated with cardiovascular disease using the NSRR dataset.", "EQUIPMENT": "Access to the NSRR dataset, computational resources for data analysis, and statistical software (e.g. R, Python).", "STEPS": ["1. Download and preprocess the NSRR dataset, focusing on sleep patterns and cardiovascular disease-related variables.", "2. Apply machine learning algorithms (e.g. clustering, regression) to identify novel sleep patterns associated with cardiovascular disease.", "3. Validate the findings using traditional statistical methods (e.g. logistic regression, Cox proportional hazards model).", "4. Perform sensitivity analysis to assess the robustness of the results."]}, "KEYWORDS": ["sleep data commons", "National Sleep Research Resource", "polysomnography", "sleep disorders", "health outcomes", "data integration", "data sharing", "machine learning", "cardiovascular disease", "sleep patterns"], "ID": "76100551babc094081466e7c9566df8fa12e5552"}
{"TITLE": "Providing Acceleration for Mobile Gaming as A Service", "YEAR": 2016, "KEY FINDINGS": "The paper proposes two systems, GBooster and UbiTouch, to address the limitations of mobile devices in terms of computational resources and input space for mobile gaming. GBooster accelerates GPU-intensive mobile applications by offloading GPU tasks onto neighboring multimedia devices, while UbiTouch extends smartphones with virtual touchpads using built-in smartphone sensors.", "MAIN RESULT": "GBooster can boost applications' frame rates by up to 85% and achieve 70% energy saving compared with local execution, while UbiTouch achieves centimeter-level localization accuracy and poses no significant impact on battery life.", "HYPOTHESIS": "The use of ambient computation capacities and built-in smartphone sensors can significantly improve the gaming experience on mobile devices.", "EXPERIMENT": {"TITLE": "Validation of GBooster and UbiTouch", "OBJECTIVE": "To validate the performance and energy efficiency of GBooster and UbiTouch in mobile gaming.", "EQUIPMENT": "Mobile devices, gaming consoles, personal computers, Smart TVs, and smartphones with built-in sensors (proximity sensor, ambient light sensor, microphone, and gyroscope).", "STEPS": ["1. Implement GBooster and UbiTouch on mobile devices.", "2. Select a set of GPU-intensive mobile games and run them on mobile devices with and without GBooster.", "3. Measure the frame rates and energy consumption of the games with and without GBooster.", "4. Evaluate the performance of UbiTouch by tracking finger movements and detecting touch actions.", "5. Compare the results with and without UbiTouch."]}, "KEYWORDS": ["Mobile gaming", "GPU acceleration", "Offloading", "Energy efficiency", "Virtual touchpad", "Built-in sensors", "Proximity sensor", "Ambient light sensor", "Microphone", "Gyroscope", "Mobile cloud computing"], "ID": "76c09eda76eec8d62ad56e553126d108779828cd"}
{"TITLE": "2021 Microscopy Today Innovation Awards", "YEAR": 2021, "KEY FINDINGS": "The paper presents five innovative microscopy technologies that advance the field of microscopy, including high-speed atomic force microscopy, lattice light-sheet microscopy, cryogenic correlative light and electron microscopy, in situ microscopy, and hybrid-pixel camera technology.", "MAIN RESULT": "These innovations enable researchers to visualize and analyze biological and materials systems with unprecedented resolution, speed, and precision, opening up new avenues for discovery in fields such as life sciences, materials science, and energy research.", "HYPOTHESIS": "The integration of multiple microscopy modalities can provide a more comprehensive understanding of complex biological and materials systems by enabling the correlation of structural, chemical, and dynamic information at the nanoscale.", "EXPERIMENT": "To validate this hypothesis, a experiment could be designed to use the NanoRacer high-speed AFM to image the dynamics of protein-protein interactions on a cell membrane, while simultaneously using the Lattice Lightsheet 7 to visualize the 3D structure of the cell. The resulting data could be correlated with cryo-EM data obtained using the METEOR system to provide a comprehensive understanding of the structural and dynamic properties of the system. Required equipment: NanoRacer high-speed AFM, Lattice Lightsheet 7, METEOR cryo-CLEM system, and a cryo-EM microscope. Steps: 1) Prepare a cell sample with fluorescently labeled proteins, 2) Use the NanoRacer to image the dynamics of protein-protein interactions, 3) Use the Lattice Lightsheet 7 to visualize the 3D structure of the cell, 4) Use the METEOR system to obtain cryo-EM data, 5) Correlate the data from the three modalities to gain a comprehensive understanding of the system.", "KEYWORDS": ["Microscopy", "Innovation", "Atomic Force Microscopy", "Lattice Light-Sheet Microscopy", "Cryogenic Correlative Light and Electron Microscopy", "In Situ Microscopy", "Hybrid-Pixel Camera", "Life Sciences", "Materials Science", "Energy Research"], "ID": "77c4fe719e24711471689bed48edfc3165e8577e"}
{"TITLE": "Developing an Intranet-Based Lymphedema Dashboard for Breast Cancer Multidisciplinary Teams: Design Research Study", "YEAR": 2020, "KEY FINDINGS": "The study developed and evaluated two prototype dashboards for displaying data on the identification and management of lymphedema in breast cancer patients. The dashboards were designed to make clinical data more accessible to health professionals, and the study found that health professionals were interested in using data visualization tools to support clinical decision making and performance review.", "MAIN RESULT": "The study demonstrated the feasibility of developing a clinical dashboard for breast cancer multidisciplinary teams, and highlighted the importance of co-design and user-centered design principles in the development of such dashboards.", "HYPOTHESIS": "The use of clinical dashboards to visualize lymphedema data can improve the early identification and management of lymphedema in breast cancer patients, leading to better patient outcomes.", "EXPERIMENT": {"Objective": "To evaluate the effectiveness of a clinical dashboard in improving the early identification and management of lymphedema in breast cancer patients.", "Design": "Randomized controlled trial", "Participants": "Breast cancer patients at risk of developing lymphedema", "Intervention": "Access to a clinical dashboard visualizing lymphedema data", "Control": "Standard care without access to the dashboard", "Outcome measures": "Time to diagnosis of lymphedema, severity of lymphedema, patient-reported outcomes", "Equipment": "Clinical dashboard software, computers or tablets for data access, bioimpedance spectroscopy machine for lymphedema measurement", "Steps": "1. Recruit participants and randomize to intervention or control group. 2. Provide access to the dashboard for the intervention group. 3. Collect outcome measures at baseline, 3 months, and 6 months. 4. Compare outcomes between groups."}, "KEYWORDS": ["eHealth", "clinical informatics", "human-centered design", "data visualization", "lymphedema", "breast cancer", "multidisciplinary teams", "clinical decision making", "performance review", "patient outcomes"], "ID": "7947a14ba59c5f67c41e78d82863aaf7e89c07b1"}
{"TITLE": "Analysis of User Experience on Website User Interface with Design Thinking (Case Study: Superyou.co.id Online Insurance)", "YEAR": 2022, "KEY FINDINGS": "The study found that users do not understand the information on the website, both visually and in terms of content, making it difficult for them to understand the purchase flow, leading to disinterest and distrust of Superyou.", "MAIN RESULT": "The study highlights the importance of design thinking in improving user experience on the Superyou.co.id website.", "HYPOTHESIS": "By applying design thinking principles, the user experience of an online insurance website can be significantly improved, leading to increased user engagement and trust.", "EXPERIMENT": {"Title": "Design Thinking Intervention on User Experience of Online Insurance Website", "Objective": "To investigate the effect of design thinking principles on user experience of an online insurance website.", "Equipment": "Computer with internet connection, Superyou.co.id website, design thinking toolkit, user experience survey questionnaire.", "Steps": ["1. Recruit 20 participants and divide them into two groups: control group and experimental group.", "2. Ask both groups to complete a user experience survey questionnaire on the current Superyou.co.id website.", "3. Apply design thinking principles to redesign the Superyou.co.id website.", "4. Ask the experimental group to complete the user experience survey questionnaire on the redesigned website.", "5. Compare the results of the two groups to determine the effect of design thinking principles on user experience."]}, "KEYWORDS": ["User Experience", "User Interface", "Website", "Design Thinking", "Human-Centered Design", "Online Insurance", "Superyou.co.id", "Insurance Industry", "Digital Transformation", "UX Design"], "ID": "796308efe0a615bee079d6480a85d1efc29f7a85"}
{"TITLE": "Design and Implementation of a Mental Health Education Application using Design Thinking", "YEAR": 2023, "KEY FINDINGS": "The study designed and implemented a mental health education application using the design thinking approach, which resulted in a user-friendly and informative application that can increase awareness and understanding of mental health among users.", "MAIN RESULT": "The prototype application received a score of 69.3% in the System Usability Scale (SUS) test, indicating a satisfactory level of usability.", "HYPOTHESIS": "The use of a design thinking approach in the development of a mental health education application can lead to a higher level of user engagement and motivation to learn about mental health.", "EXPERIMENT": {"Title": "Evaluating the Effectiveness of a Design Thinking-Based Mental Health Education Application", "Objective": "To compare the level of user engagement and motivation to learn about mental health between a design thinking-based application and a traditional application.", "Equipment": "Two versions of the mental health education application (one developed using design thinking and one developed using a traditional approach), smartphones or tablets, internet connection, and a survey questionnaire.", "Steps": ["Recruit 100 participants and randomly assign them to use either the design thinking-based application or the traditional application.", "Ask participants to use the assigned application for a set period of time (e.g., 2 weeks).", "Administer a survey questionnaire to participants to assess their level of engagement and motivation to learn about mental health.", "Compare the results between the two groups and analyze the data using statistical methods."]}, "KEYWORDS": ["Mental Health Education", "Design Thinking", "User Experience", "User Interface", "E-Learning", "Health Education", "Mobile Application", "Usability Testing", "System Usability Scale (SUS)", "User Engagement"], "ID": "7c79e3c510d6d5a42b2b0989b58b80c72880c6b3"}
{"TITLE": "ADVANTAGES OF IMPLEMENTING ARTIFICIAL INTELLIGENCE IN E-BUSINESS FOR CONSUMERS", "YEAR": 2022, "KEY FINDINGS": "The paper explores the benefits of implementing artificial intelligence (AI) in e-business, including improved design and navigation, enhanced customer experience, and increased efficiency of transactions. AI-powered search algorithms, visual search, predictive search, and voice search can improve user experience, while chatbots and virtual assistants can provide personalized support and recommendations.", "MAIN RESULT": "The integration of AI in e-business can lead to improved customer satisfaction, increased engagement, and enhanced competitiveness in the digital marketplace.", "HYPOTHESIS": "The use of AI-powered personalized recommendations in e-business can lead to a significant increase in customer loyalty and retention.", "EXPERIMENT": {"TITLE": "AI-Powered Personalized Recommendations and Customer Loyalty", "OBJECTIVE": "To investigate the effect of AI-powered personalized recommendations on customer loyalty and retention in e-business.", "EQUIPMENT": "E-commerce platform with AI-powered recommendation system, customer data, and loyalty program metrics.", "STEPS": ["1. Randomly assign customers to either a control group or an experimental group.", "2. The control group receives standard product recommendations, while the experimental group receives AI-powered personalized recommendations.", "3. Measure customer loyalty and retention metrics (e.g., repeat purchases, customer satisfaction) over a 6-month period.", "4. Compare the loyalty and retention metrics between the control and experimental groups."]}, "KEYWORDS": ["Artificial Intelligence", "E-Business", "E-Commerce", "User Experience", "Personalized Recommendations", "Chatbots", "Virtual Assistants", "Search Algorithms", "Visual Search", "Predictive Search", "Voice Search"], "ID": "7f1343a62fbd0cb69e1e0a11ca8785bc8a1d3f38"}
{"TITLE": "Systematic Improvement of User Engagement with Academic Titles using Computational Linguistics", "YEAR": 2019, "KEY FINDINGS": "The study found that user engagement with digital information is fostered by, and perhaps dependent upon, the wording being used. The results also provide empirical support that engaging content can be systematically evaluated and produced.", "MAIN RESULT": "The modified (treatment) titles had significantly higher scores for information use and user engagement (selection and evaluation).", "HYPOTHESIS": "The use of 'sticky words' (words that are familiar, novel, and emotive) in digital content can increase user engagement and motivation to consume the content.", "EXPERIMENT": {"TITLE": "Evaluating the Effect of 'Sticky Words' on User Engagement", "OBJECTIVE": "To investigate the impact of 'sticky words' on user engagement with digital content.", "METHODS": ["Recruit 200 participants and randomly assign them to two groups: a control group and a treatment group.", "Prepare two sets of digital content (e.g. academic titles) with identical meaning but differing in the use of 'sticky words'.", "Ask participants to evaluate the content using the User Engagement Scale (UES).", "Compare the UES scores between the control and treatment groups."], "EQUIPMENT": ["Computers or mobile devices with internet access", "UES questionnaire", "Digital content with and without 'sticky words'"], "EXPECTED OUTCOME": "The treatment group will show higher UES scores, indicating increased user engagement, compared to the control group."}, "KEYWORDS": ["User Engagement", "Computational Linguistics", "Digital Content", "Sticky Words", "Information Interaction", "User Experience", "Knowledge Acquisition", "Decision-Making", "Content Strategy", "Digital Nudging"], "ID": "7f573f4403f5e9925325da663b0630a2fe561fe0"}
{"TITLE": "Experiences through customizations: looking beyond game’s mechanics", "YEAR": 2023, "KEY FINDINGS": "The paper explores the significance of customization in digital games, highlighting its potential to enhance user experience and foster interaction. The study reveals that players derive enjoyment from customizing their in-game characters and consider it an integral part of their gaming journey.", "MAIN RESULT": "Customization can serve as a valuable tool to enhance players' sense of attachment to the game universe.", "HYPOTHESIS": "Customization options in digital games can increase player engagement and overall satisfaction by providing a sense of ownership and control over the gaming experience.", "EXPERIMENT": {"Title": "Customization and Player Engagement", "Objective": "To investigate the effect of customization options on player engagement and satisfaction in digital games.", "Equipment": "A digital game with customizable elements (e.g., character appearance, abilities, and environment), a control group without customization options, and a survey to measure player engagement and satisfaction.", "Steps": ["Recruit participants and randomly assign them to either the control group or the customization group.", "Have participants play the game for a set amount of time (e.g., 30 minutes).", "Administer a survey to measure player engagement and satisfaction.", "Compare the results between the control group and the customization group to determine if customization options have a significant impact on player engagement and satisfaction."]}, "KEYWORDS": ["games", "user experience", "game customization", "design", "digital games", "player engagement", "satisfaction", "interaction", "immersion", "flow state"], "ID": "807c0b870c5307dd7e0597363a594a3f393b7c56"}
{"TITLE": "Feedback and Control of Dynamics and Robotics using Augmented Reality", "YEAR": 2022, "KEY FINDINGS": "The paper proposes the use of Augmented Reality (AR) to improve human-machine interaction and human-robot interaction in dynamics and robotics. Three AR applications were developed to enhance human control: actuator control, robot position control, and robot frequency control.", "MAIN RESULT": "The results show that the AR applications can effectively enhance human control in dynamics and robotics, with a time delay of approximately 0.1 seconds in actuator control.", "HYPOTHESIS": "The use of AR can reduce the cognitive load of humans in dynamics and robotics experiments, leading to more accurate and efficient control.", "EXPERIMENT": {"TITLE": "Cognitive Load Reduction Experiment", "OBJECTIVE": "To investigate the effect of AR on cognitive load in dynamics and robotics experiments.", "EQUIPMENT": "HoloLens 2, LEWIS5 sensor, electrodynamic exciter, robot arm, MATLAB software", "STEPS": ["1. Recruit 20 participants with experience in dynamics and robotics experiments.", "2. Divide participants into two groups: AR group and traditional control group.", "3. Have each participant perform a series of experiments using either AR or traditional control methods.", "4. Measure the time taken to complete each experiment and the accuracy of the results.", "5. Use a cognitive load questionnaire to assess the participants' perceived cognitive load.", "6. Compare the results between the two groups to determine if AR reduces cognitive load."]}, "KEYWORDS": ["Augmented Reality", "Human-Machine Interaction", "Human-Robot Interaction", "Dynamics", "Robotics", "Actuator Control", "Robot Position Control", "Robot Frequency Control", "Cognitive Load", "LEWIS5 Sensor", "HoloLens 2"], "ID": "81738413590a540c406e54f00a42f1a0812384a7"}
{"TITLE": "The impact of website design on consumer decision making – evidence from North Macedonia", "YEAR": 2023, "KEY FINDINGS": "The paper discusses the importance of website design quality on consumer decision-making in e-commerce, highlighting its impact on online purchase intentions, impulse buying behavior, and trust. It also explores the growing concern of environmental sustainability in e-commerce and the role of sustainable web design in reducing carbon footprint.", "MAIN RESULT": "The study emphasizes the significance of website design quality as a multi-dimensional construct that influences consumer behavior and attitude, and suggests that e-vendors should improve website quality features to promote online shopping and enhance user trust.", "HYPOTHESIS": "Sustainable web design can positively influence consumer purchase decisions and reduce carbon footprint in e-commerce.", "EXPERIMENT": {"Title": "Assessing the Impact of Sustainable Web Design on Consumer Purchase Decisions", "Objective": "To investigate whether sustainable web design can positively influence consumer purchase decisions and reduce carbon footprint in e-commerce.", "Equipment": "Online survey platform, website design software, carbon footprint calculator", "Steps": ["1. Design two versions of an e-commerce website: one with sustainable design features (e.g., green hosting, reduced image sizes, eco-friendly content) and one without.", "2. Recruit participants and randomly assign them to either the sustainable design or control group.", "3. Ask participants to complete an online survey assessing their purchase intentions, attitudes towards sustainability, and perceived website quality.", "4. Calculate the carbon footprint of each website using a carbon footprint calculator.", "5. Compare the results between the two groups to determine if sustainable web design has a positive impact on consumer purchase decisions and carbon footprint reduction."]}, "KEYWORDS": ["e-commerce", "website design", "consumer behavior", "sustainable web design", "carbon footprint", "online shopping", "environmental sustainability", "purchase intentions", "trust", "green coding"], "ID": "8304a15b1bae1480a9d6ae03787a6b39b05b491f"}
{"TITLE": "Penerapan Pola Tata Letak (Layout Pattern) pada Wireframing Halaman Situs Web", "YEAR": 2019, "KEY FINDINGS": "The application of layout patterns such as Gutenberg, Z-pattern, and F-pattern can be used to optimize the visual composition of wireframe design, and the use of wireframing is an important process in designing a website as it determines the information structure and priority.", "MAIN RESULT": "The study shows that the application of layout patterns can improve the visual appearance of wireframe design and enhance the user experience.", "HYPOTHESIS": "The use of layout patterns in wireframing can increase the user engagement and conversion rate of a website.", "EXPERIMENT": {"TITLE": "The Effect of Layout Patterns on User Engagement and Conversion Rate", "OBJECTIVE": "To investigate the effect of layout patterns on user engagement and conversion rate of a website.", "METHODOLOGY": {"PARTICIPANTS": "100 participants will be recruited for this study.", "DESIGN": "A between-subjects design will be used, where participants will be randomly assigned to one of three groups: Gutenberg pattern, Z-pattern, and F-pattern.", "TASK": "Participants will be asked to complete a task on a website with one of the three layout patterns.", "MEASUREMENTS": "User engagement will be measured using time-on-task, click-through rate, and bounce rate. Conversion rate will be measured using the number of completed tasks."}, "EQUIPMENT": {"COMPUTERS": "100 computers with internet access", "SOFTWARE": "Website with three different layout patterns", "TOOLS": "Google Analytics"}, "PROCEDURE": {"STEP 1": "Recruit participants and assign them to one of the three groups.", "STEP 2": "Ask participants to complete a task on the website with the assigned layout pattern.", "STEP 3": "Measure user engagement and conversion rate using Google Analytics.", "STEP 4": "Compare the results between the three groups."}}, "KEYWORDS": ["Wireframing", "Layout Pattern", "Gutenberg Pattern", "Z-Pattern", "F-Pattern", "User Experience", "User Engagement", "Conversion Rate", "Web Design", "Information Architecture"], "ID": "85e27f2da262b383783a131f759841700467fe3c"}
{"TITLE": "Possible applications of the LEAP Motion controller for more interactive simulated experiments in Augmented or Virtual Reality", "YEAR": 2016, "KEY FINDINGS": "The paper discusses the potential of the LEAP Motion controller for augmented reality (AR) and virtual reality (VR) applications, particularly in education. It highlights the advantages of using the LEAP Motion controller for interactive simulations, including its ability to track hand and finger movements in 3D space.", "MAIN RESULT": "The paper demonstrates the feasibility of using the LEAP Motion controller for AR and VR applications, and identifies its strengths and weaknesses in various scenarios.", "HYPOTHESIS": "The LEAP Motion controller can enhance the learning experience in educational simulations by providing a more immersive and interactive environment.", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of the LEAP Motion Controller in Educational Simulations", "OBJECTIVE": "To investigate the impact of the LEAP Motion controller on student engagement and learning outcomes in educational simulations.", "EQUIPMENT": "LEAP Motion controller, VR/AR software, computer, educational simulation software", "STEPS": ["Recruit participants and divide them into two groups: one using the LEAP Motion controller and the other using traditional input methods.", "Have participants complete a series of educational simulations using their assigned input method.", "Measure participant engagement and learning outcomes using surveys, quizzes, and performance metrics.", "Compare the results between the two groups to determine the effectiveness of the LEAP Motion controller."]}, "KEYWORDS": ["Augmented Reality", "Virtual Reality", "LEAP Motion controller", "Education", "Simulation", "Human-Computer Interaction", "Interactive Learning", "Immersive Experience", "Gesture Recognition", "Motion Tracking"], "ID": "8864cfa842962dec8c91ad508825fa1406c9698b"}
{"TITLE": "Comparing the Performance and Evaluation of Computer Experts and Farmers when Operating Agricultural Robots: A Case of Tangible vs Mouse-Based UIs", "YEAR": 2022, "KEY FINDINGS": "The study compared the performance of computer experts and farmers when operating agricultural robots using tangible and mouse-based user interfaces. The results showed that there were no significant differences in efficiency, accuracy, and user satisfaction between the two interfaces for each group, but computer experts were faster and farmers preferred the tangible interface.", "MAIN RESULT": "The tangible interface received more positive evaluations in terms of user preference, and users reported lower perceived error rates, especially in the case of farmers.", "HYPOTHESIS": "Farmers with prior experience with tangible interfaces will outperform computer experts with no prior experience with tangible interfaces in terms of efficiency and accuracy when operating agricultural robots.", "EXPERIMENT": {"Title": "Evaluating the Effect of Prior Experience with Tangible Interfaces on Performance in Agricultural Robot Operation", "Equipment": "Agricultural robots, tangible interface, mouse-based interface, computer, questionnaire", "Steps": ["Recruit 20 farmers with prior experience with tangible interfaces and 20 computer experts with no prior experience with tangible interfaces.", "Divide each group into two subgroups, one using the tangible interface and the other using the mouse-based interface.", "Ask participants to complete a task of operating two agricultural robots to spray a vineyard field.", "Measure the time to complete the task, number of collisions, and percentage of unsprayed and double-sprayed area.", "Administer a questionnaire to evaluate user satisfaction and perceived error rates.", "Compare the results between the two groups and interfaces."]}, "KEYWORDS": ["Tangible user interface", "Mouse-based interface", "Agricultural robots", "Human-robot interaction", "User experience", "Performance evaluation", "Computer experts", "Farmers", "Prior experience", "Robot operation"], "ID": "88c6ce7362e2727644e0ce97512cd910c8fee899"}
{"TITLE": "Gamification of Assembly Planning in Virtual Environment", "YEAR": 2018, "KEY FINDINGS": "The gamification of virtual assembly planning reduced the number of errors and increased the score representing the number of right decisions. The results of the subjective and objective analysis showed that the number of errors decreased with engagement in the gamified assembly.", "MAIN RESULT": "The gamification of virtual assembly planning improved user performance, user experience, and engagement.", "HYPOTHESIS": "The use of gamification elements in virtual assembly planning can improve the retention of assembly skills and knowledge over time.", "EXPERIMENT": {"TITLE": "Long-term Retention of Assembly Skills with Gamification", "OBJECTIVE": "To investigate the effect of gamification on the long-term retention of assembly skills and knowledge.", "EQUIPMENT": "Multi-touch table, virtual assembly software, gamification elements (e.g. points, badges, leaderboards), and a control group without gamification.", "STEPS": ["Recruit participants and divide them into two groups: a gamified group and a control group.", "Train both groups on a virtual assembly task using the same software and equipment.", "Administer a pre-test to assess the participants' assembly skills and knowledge.", "Have the gamified group complete the assembly task with gamification elements, while the control group completes the task without gamification.", "Administer a post-test to assess the participants' assembly skills and knowledge immediately after the task.", "Administer a retention test to assess the participants' assembly skills and knowledge after a period of 2-3 months.", "Compare the results of the post-test and retention test between the gamified and control groups."]}, "KEYWORDS": ["Gamification", "Virtual Assembly", "Assembly Planning", "User Performance", "User Experience", "Engagement", "Retention", "Assembly Skills", "Knowledge Retention", "Virtual Reality"], "ID": "8d6d86fcf993b35c29835bde194e04bd88835c5a"}
{"TITLE": "EXPLORING THE SYNERGISTIC INTEGRATION OF ARTIFICIAL INTELLIGENCE AND DROPSHIPPING", "YEAR": 2023, "KEY FINDINGS": "The paper proposes an AI-powered dropshipping platform that automates and optimizes product selection, website building, and shop administration, leading to increased efficiency, profitability, and customer satisfaction.", "MAIN RESULT": "The platform's AI-driven product selection algorithm accurately identifies profitable and high-quality items, and its scalability is demonstrated through experiments.", "HYPOTHESIS": "The use of AI-powered dropshipping platforms can lead to a significant increase in the success rate of dropshipping businesses, resulting in a more robust and sustainable e-commerce ecosystem.", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of AI-Powered Dropshipping Platforms", "OBJECTIVE": "To compare the success rate of dropshipping businesses using AI-powered platforms versus traditional methods.", "REQUIRED EQUIPMENT": "AI-powered dropshipping platform, traditional dropshipping tools, e-commerce website, product data, customer data", "STEPS": ["Recruit 100 participants with dropshipping experience and divide them into two groups: one using the AI-powered platform and the other using traditional methods.", "Provide both groups with the same product data and customer data.", "Monitor and record the success rate of each group over a period of 6 months, including metrics such as sales, customer satisfaction, and profit margins.", "Compare the results of both groups and analyze the data to determine the effectiveness of the AI-powered platform."]}, "KEYWORDS": ["Artificial Intelligence", "Dropshipping", "E-commerce", "Product Selection", "Website Generation", "Scalability", "Machine Learning", "Automation", "Customer Experience", "Supply Chain Management"], "ID": "8e8e5f438159cdfd627ddc742be2571d473c9c50"}
{"TITLE": "Design of QR Code Technology in MC Swimming Pool Website to Improve User Experience and Operational Efficiency", "YEAR": 2024, "KEY FINDINGS": "The paper proposes the integration of QR Code technology on the MC Swimming Pool website to improve user experience and operational efficiency. The system design uses the Waterfall method and PHP programming language with CodeIgniter 3 Framework and MySQL as the Database management system.", "MAIN RESULT": "The research aims to create an information system plan that allows users to order tickets online and visitors can enter the swimming pool area quickly and easily using a QR code as a visitor entry ticket.", "HYPOTHESIS": "The integration of QR Code technology on the MC Swimming Pool website will significantly reduce waiting times and increase operational efficiency during peak periods.", "EXPERIMENT": {"TITLE": "QR Code Technology Integration Experiment", "OBJECTIVE": "To validate the hypothesis that the integration of QR Code technology on the MC Swimming Pool website reduces waiting times and increases operational efficiency during peak periods.", "EQUIPMENT": "MC Swimming Pool website with QR Code technology integration, stopwatch, queue management software, and user feedback survey forms.", "STEPS": ["1. Implement QR Code technology on the MC Swimming Pool website.", "2. Measure waiting times and operational efficiency during peak periods without QR Code technology integration.", "3. Measure waiting times and operational efficiency during peak periods with QR Code technology integration.", "4. Compare the results from steps 2 and 3 to determine the impact of QR Code technology integration.", "5. Conduct user feedback surveys to assess user experience and satisfaction."]}, "KEYWORDS": ["QR Code Technology", "Swimming Pool Management", "Operational Efficiency", "User Experience", "Waterfall Method", "PHP Programming Language", "CodeIgniter 3 Framework", "MySQL Database", "Queue Management", "Peak Period Management"], "ID": "90964bde36cef7ebdc241ef5377eac56be1c09ae"}
{"TITLE": "Implementasi Aplikasi Toko Creative Card Berbasis Website Menggunakan Metode Waterfall", "YEAR": 2024, "KEY FINDINGS": "The paper presents the development of a web-based online sticker shop application using the waterfall method. The application aims to provide convenience in the process of selling and purchasing stickers, optimize user experience, and increase product accessibility via online platforms.", "MAIN RESULT": "The result of this research is an online sticker shop application that not only makes the sales process easier for sellers but also provides a comfortable online shopping environment for buyers.", "HYPOTHESIS": "The use of the waterfall method in developing an e-commerce website can increase the efficiency of sales management and competitiveness of the business.", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of the Waterfall Method in E-commerce Website Development", "OBJECTIVE": "To investigate whether the use of the waterfall method in developing an e-commerce website can increase the efficiency of sales management and competitiveness of the business.", "REQUIRED EQUIPMENT": "Computer with internet connection, web development software, and testing tools.", "STEPS TO FOLLOW": ["1. Develop two e-commerce websites, one using the waterfall method and the other using an agile method.", "2. Measure the time and cost of development, as well as the number of defects and changes required during the development process.", "3. Conduct user testing and gather feedback on the usability and user experience of both websites.", "4. Analyze the sales data and customer satisfaction ratings of both websites over a period of six months.", "5. Compare the results and draw conclusions on the effectiveness of the waterfall method in e-commerce website development."]}, "KEYWORDS": ["e-commerce", "waterfall method", "web development", "online shopping", "sales management", "business competitiveness", "user experience", "usability testing", "software development methodologies"], "ID": "91267f82678f6005cdc6bf5dbe8a75af29ec63b1"}
{"TITLE": "Analysis and Design of UI/UX Mobile Applications for Marketing of UMKM Products Using Design Thinking Method", "YEAR": 2022, "KEY FINDINGS": "The study found that the Design Thinking method can be used to design a UI/UX mobile application that meets the needs of UMKM actors and consumers, and that the application can improve the user experience and increase sales.", "MAIN RESULT": "The study resulted in a prototype design of a mobile application that incorporates features such as authentication, product search, shopping cart, payment method, and delivery service selection, which can be used by UMKM actors and consumers.", "HYPOTHESIS": "The use of Design Thinking method in designing a mobile application for UMKM products can increase the user engagement and satisfaction, leading to an increase in sales and revenue for UMKM actors.", "EXPERIMENT": {"Title": "Design Thinking Method in Mobile Application Design for UMKM Products", "Objective": "To validate the hypothesis that the use of Design Thinking method in designing a mobile application for UMKM products can increase user engagement and satisfaction, leading to an increase in sales and revenue for UMKM actors.", "Equipment": "Mobile devices, Design Thinking toolkit, survey questionnaire, and sales data tracking software.", "Steps": ["Recruit 100 UMKM actors and 100 consumers to participate in the study.", "Divide the participants into two groups: control group and experimental group.", "Design a mobile application for UMKM products using the Design Thinking method for the experimental group.", "Conduct a survey to measure user engagement and satisfaction for both groups.", "Track sales data for both groups for a period of 3 months.", "Compare the results of the survey and sales data between the two groups to validate the hypothesis."]}, "KEYWORDS": ["Design Thinking", "UI/UX", "Mobile Application", "UMKM", "E-commerce", "User Experience", "User Engagement", "Satisfaction", "Sales", "Revenue"], "ID": "91fb67b53ae9913f2a58b301f6957e36e775b43d"}
{"TITLE": "Westminster Serious Games Platform (wmin-SGP) a tool for real-time authoring of roleplay simulations for learning", "YEAR": 2016, "KEY FINDINGS": "The paper presents the Westminster Serious Games Platform (wmin-SGP), a real-time authoring tool that allows educators/domain experts without games design and development technical skills to create bespoke roleplay simulations in three dimensional scenes featuring fully embodied virtual humans capable of verbal and non-verbal interaction with users fit for specific educational objectives.", "MAIN RESULT": "The wmin-SGP provides an intuitive environment and tools that support users without advanced technical skills to create in real-time bespoke roleplay simulations in advanced graphical interfaces, satisfies most of the usability principles, and provides balanced simulations based on the Octalysis framework core drives.", "HYPOTHESIS": "The use of virtual humans in serious games can increase student engagement and motivation in educational settings.", "EXPERIMENT": {"TITLE": "Evaluating the Effect of Virtual Humans on Student Engagement in Serious Games", "OBJECTIVE": "To investigate whether the use of virtual humans in serious games increases student engagement and motivation in educational settings.", "METHODS": "Recruit 100 students and randomly assign them to two groups: a control group that plays a serious game without virtual humans and an experimental group that plays a serious game with virtual humans. Measure student engagement and motivation using surveys and observational data. Compare the results between the two groups.", "EQUIPMENT": "Computers or gaming consoles with the serious game software, survey questionnaires, observational data collection tools.", "STEPS": "1. Develop a serious game with and without virtual humans. 2. Recruit students and randomly assign them to the control or experimental group. 3. Have students play the game for 30 minutes. 4. Administer surveys to measure engagement and motivation. 5. Collect observational data on student behavior during gameplay. 6. Compare the results between the two groups."}, "KEYWORDS": ["Serious Games", "Virtual Humans", "Roleplay Simulations", "Gamification", "Education", "Learning", "Engagement", "Motivation", "Octalysis Framework", "Game-Based Learning"], "ID": "95c0ed31ee1a3978cf3c5b28b1bb1cf287060882"}
{"TITLE": "A Novel Natural Mobile Human-Machine Interaction Method With Augmented Reality", "YEAR": 2019, "KEY FINDINGS": "The paper proposes a novel mobile human-machine interaction method that allows users to guide robots hand by hand along with speech using augmented reality (AR) technology. The method uses a Leap Motion sensor and an AR wearable device to establish a 3D operation interface, enabling users to directly interact with virtual robots.", "MAIN RESULT": "The proposed method enhances the users' interactive immersion and provides more natural human-machine interaction.", "HYPOTHESIS": "The use of augmented reality technology in human-machine interaction can improve the accuracy and efficiency of task completion.", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of Augmented Reality in Human-Machine Interaction", "OBJECTIVE": "To compare the performance of users using the proposed AR-based human-machine interaction method with traditional methods in completing a task.", "EQUIPMENT": "AR wearable device, Leap Motion sensor, computer, task simulation software", "STEPS": ["Recruit 20 participants and divide them into two groups: one using the proposed AR-based method and the other using a traditional method.", "Have each participant complete a task, such as assembling a virtual object, using their assigned method.", "Measure the time taken to complete the task and the accuracy of the task completion.", "Compare the results between the two groups and analyze the data to determine if the AR-based method is more effective."]}, "KEYWORDS": ["Augmented Reality", "Human-Machine Interaction", "Mobile Interaction", "Leap Motion", "Virtual Robots", "Natural Interaction", "Teleoperation", "Robotics", "Computer Vision", "Machine Learning"], "ID": "99c4fb53d990011fb7448c67f8aa393133fb7396"}
{"TITLE": "Exploring the Role of Personalization in Adaptive Learning Environments", "YEAR": 2023, "KEY FINDINGS": "The paper explores the role of personalization in adaptive learning environments, highlighting its potential to improve learning outcomes and increase student engagement. The authors discuss the importance of tailoring learning experiences to individual students' needs, abilities, and learning styles, and review existing research on adaptive learning systems.", "MAIN RESULT": "The paper concludes that personalization is a crucial component of effective adaptive learning environments, and that it can lead to improved learning outcomes, increased student motivation, and more efficient use of instructional time.", "HYPOTHESIS": "Personalization in adaptive learning environments can be optimized by incorporating real-time feedback and assessment data to dynamically adjust the learning path and content to individual students' needs and abilities.", "EXPERIMENT": {"Title": "Optimizing Personalization in Adaptive Learning Environments", "Objective": "To investigate the effect of real-time feedback and assessment data on the optimization of personalization in adaptive learning environments.", "Equipment": "Adaptive learning software, learning management system, student devices (e.g., laptops, tablets), assessment tools (e.g., quizzes, tests), and feedback mechanisms (e.g., automated grading, teacher feedback).", "Steps": "1. Recruit a sample of students and assign them to either a control group or an experimental group. 2. Develop an adaptive learning module on a specific topic (e.g., mathematics, language arts) with varying levels of difficulty and complexity. 3. Implement real-time feedback and assessment data in the experimental group, using automated grading and teacher feedback to adjust the learning path and content. 4. Compare the learning outcomes, student engagement, and time-on-task between the control and experimental groups. 5. Analyze the data using statistical methods (e.g., ANOVA, regression) to determine the effect of real-time feedback and assessment data on personalization optimization."}, "KEYWORDS": ["Adaptive Learning", "Personalization", "Learning Environments", "Real-time Feedback", "Assessment Data", "Learning Outcomes", "Student Engagement", "Instructional Design", "Education Technology", "Artificial Intelligence in Education"], "ID": "9c14fcc53fc43334ab165cb73eec73c884bc3de4"}
{"TITLE": "Designing a Quality Tilapia Sales Website Using RAD Method", "YEAR": 2023, "KEY FINDINGS": "The current system of selling tilapia fish is inefficient, with data loss and inaccuracy due to manual recording. The use of a website can increase market accessibility, expand customer reach, and improve the user trading experience.", "MAIN RESULT": "The design and implementation of a Condet Fish website using the RAD method can facilitate buying and selling transactions of quality tilapia fish.", "HYPOTHESIS": "The use of a website for selling tilapia fish can increase sales and customer satisfaction by providing a convenient and efficient platform for transactions.", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of a Tilapia Sales Website", "OBJECTIVE": "To compare the sales and customer satisfaction of a tilapia fish business using a website versus traditional methods.", "METHODS": ["Recruit 100 customers to participate in the study.", "Divide participants into two groups: one group will use the website to purchase tilapia fish, and the other group will use traditional methods.", "Measure sales and customer satisfaction using surveys and sales data.", "Compare the results between the two groups."], "EQUIPMENT": ["Computers with internet access", "Survey software", "Sales data tracking software"], "EXPECTED OUTCOME": "The group using the website will have higher sales and customer satisfaction compared to the group using traditional methods."}, "KEYWORDS": ["Tilapia fish", "E-commerce", "RAD method", "Website design", "Sales platform", "Customer satisfaction", "Market accessibility", "Online transactions", "Fish sales", "Business efficiency"], "ID": "a48c76863d441bd2c289cb8754cb3cfd53f9e7b2"}
{"TITLE": "Study on Business Model Innovation at Zhuanzhuan Company", "YEAR": 2023, "KEY FINDINGS": "Zhuanzhuan Company has achieved significant success in the second-hand trading market through its business model innovation, which includes a combination of C2C and C2B2C models, official verification, and logistics management. The company's strengths lie in its wide user base, high brand recognition, and mobile-first strategy. However, it faces weaknesses such as intense competition and trust issues.", "MAIN RESULT": "Zhuanzhuan Company's business model innovation has enabled it to lead the second-hand trading market in China and provide young people with sustainable and high-quality consumption choices.", "HYPOTHESIS": "The integration of offline experience and online platform can increase user trust and satisfaction in the second-hand trading market.", "EXPERIMENT": {"Title": "Offline-Online Integration Experiment", "Objective": "To investigate the effect of integrating offline experience and online platform on user trust and satisfaction in the second-hand trading market.", "Equipment": "Offline stores, online platform, survey questionnaires, and statistical analysis software.", "Steps": ["1. Select a sample of users who have made purchases on Zhuanzhuan's online platform.", "2. Divide the sample into two groups: one group will receive offline experience (e.g., visiting a physical store) and the other group will not.", "3. Measure user trust and satisfaction through survey questionnaires before and after the experiment.", "4. Compare the results between the two groups using statistical analysis software.", "5. Analyze the results to determine if the integration of offline experience and online platform increases user trust and satisfaction."]}, "KEYWORDS": ["Business Model Innovation", "Second-Hand Trading Market", "Zhuanzhuan Company", "C2C", "C2B2C", "Offline Experience", "Online Platform", "User Trust", "Satisfaction", "Sustainable Consumption", "Circular Economy"], "ID": "a62ab228162c81233d8cb0b4e50e134d6eaef244"}
{"TITLE": "INDUSTRIAL DESIGN APPROACH TO SPECIFIC ENGINEERING DESIGN", "YEAR": 2019, "KEY FINDINGS": "The paper discusses the importance of industrial design in robotics, particularly in the development of SCARA robots. It highlights the need for a human-centered approach to design, considering factors such as ergonomics, user experience, and safety. The authors propose a new design concept for a SCARA robot that integrates industrial design principles with engineering design.", "MAIN RESULT": "The paper presents a redesigned SCARA robot that incorporates industrial design principles, resulting in a more user-friendly and efficient robot.", "HYPOTHESIS": "The integration of industrial design principles in robotics can lead to more efficient and user-friendly robots that are better suited to meet the needs of a wider range of users.", "EXPERIMENT": "To validate this hypothesis, an experiment could be conducted to compare the performance and user experience of the redesigned SCARA robot with a traditional SCARA robot. The experiment would require: * Two SCARA robots: one with the traditional design and one with the redesigned industrial design approach * A group of users with varying levels of experience with robots * A set of tasks that require the users to interact with the robots * A survey or questionnaire to gather user feedback on the usability and efficiency of the robots The experiment would involve having the users complete the tasks with both robots and then completing the survey or questionnaire to gather their feedback. The results would be analyzed to compare the performance and user experience of the two robots.", "KEYWORDS": ["Industrial Design", "SCARA Robot", "Engineering Design", "Human-Centered Design", "Ergonomics", "User Experience", "Robotics", "Design Principles", "Innovation", "Manufacturing"], "ID": "a829793afd0b47e757b727f1818fce09e6f262c0"}
{"TITLE": "A Patient-Centered Information System (myED) for Emergency Care Journeys: Design, Development, and Initial Adoption", "YEAR": 2020, "KEY FINDINGS": "The study developed and tested a patient-centered information system, myED, which provides patients with real-time information about their emergency department (ED) journey, including procedures, waiting times, and expected length of stay. The system was found to improve patients' understanding of their ED journey and was well-received by patients and healthcare providers.", "MAIN RESULT": "The study found that 30.48% of patients used myED during the third month of deployment, and patients who used myED had a significant improvement in their understanding of their ED journey.", "HYPOTHESIS": "Providing patients with real-time information about their ED journey through a patient-centered information system like myED can reduce anxiety and improve patient satisfaction in the ED.", "EXPERIMENT": {"Title": "The Effect of myED on Patient Anxiety and Satisfaction in the ED", "Objective": "To investigate the effect of myED on patient anxiety and satisfaction in the ED.", "Design": "Randomized controlled trial", "Participants": "500 patients presenting to the ED", "Intervention": "Patients will be randomly assigned to either the myED group or a control group. The myED group will have access to the myED system, while the control group will not.", "Outcome Measures": "Patient anxiety levels will be measured using a standardized anxiety scale, and patient satisfaction will be measured using a standardized satisfaction survey.", "Equipment": "myED system, anxiety scale, satisfaction survey", "Steps": "1. Patients will be recruited and randomly assigned to either the myED group or the control group. 2. Patients in the myED group will be given access to the myED system. 3. Patient anxiety levels and satisfaction will be measured at baseline, 30 minutes after arrival, and at discharge. 4. Data will be analyzed using t-tests and regression analysis."}, "KEYWORDS": ["Patient-centered care", "Emergency department", "Health information system", "Patient satisfaction", "Anxiety", "Waiting times", "Length of stay", "Process mining", "User-centered design", "Mobile health"], "ID": "ae2e8e4a977e6e12d79e4880f544f1eb706c7c0c"}
{"TITLE": "Factors influencing trust in university websites: A survey amongst Generation Y students in South Africa", "YEAR": 2019, "KEY FINDINGS": "The study found that perceived system quality and information quality of university websites have a significant positive influence on Generation Y students' trust in university websites.", "MAIN RESULT": "The results suggest that universities can increase trust among Generation Y students by improving the system quality and information quality of their websites.", "HYPOTHESIS": "Improving the system quality and information quality of university websites can increase the conversion rate of prospective students into enrolled students.", "EXPERIMENT": {"Title": "The Effect of System Quality and Information Quality on Conversion Rate of Prospective Students", "Objective": "To investigate the effect of system quality and information quality of university websites on the conversion rate of prospective students into enrolled students.", "Equipment": "University website with varying levels of system quality and information quality, Prospective students, Online application system", "Steps": ["1. Recruit prospective students and randomly assign them to one of three groups: high system quality and high information quality, low system quality and low information quality, and control group.", "2. Measure the conversion rate of prospective students into enrolled students for each group.", "3. Analyze the data using ANOVA and regression analysis to determine the effect of system quality and information quality on conversion rate."]}, "KEYWORDS": ["Generation Y students", "University websites", "System quality", "Information quality", "Trust", "Conversion rate", "Prospective students", "Enrolled students", "Online application system", "Higher education"], "ID": "aef3c042e495d7faaa4c57acab15898a085efc43"}
{"TITLE": "An Investigation into Antecedents of Customer Satisfaction and Loyalty with Reference to Online Purchasing Behavior", "YEAR": 2024, "KEY FINDINGS": "The study found that website usability, product information, security, customer service quality, delivery services, perceived value, trust, personalized experiences, and loyalty programs are key antecedents of customer satisfaction and loyalty in online purchasing behavior. Age and gender also play a significant role in shaping customer satisfaction.", "MAIN RESULT": "The study concluded that businesses can enhance customer satisfaction and loyalty by understanding and addressing the various antecedents of online purchasing behavior.", "HYPOTHESIS": "Personalized experiences and loyalty programs can increase customer satisfaction and loyalty in online purchasing behavior, particularly among younger generations.", "EXPERIMENT": {"Title": "The Effect of Personalized Experiences and Loyalty Programs on Customer Satisfaction and Loyalty", "Objective": "To investigate the impact of personalized experiences and loyalty programs on customer satisfaction and loyalty in online purchasing behavior.", "Equipment": "Online survey platform, loyalty program software, personalized recommendation algorithm", "Steps": ["Recruit 200 participants aged 18-35 and randomly assign them to one of two groups: a control group and a treatment group.", "Provide the treatment group with personalized product recommendations and loyalty program offers, while the control group receives standard product listings and no loyalty program offers.", "Measure customer satisfaction and loyalty using online surveys and behavioral data (e.g., purchase history, browsing behavior) at three time points: before, during, and after the experiment.", "Compare the results between the two groups to determine the effect of personalized experiences and loyalty programs on customer satisfaction and loyalty."]}, "KEYWORDS": ["Customer satisfaction", "Loyalty", "Online purchasing behavior", "Personalized experiences", "Loyalty programs", "Age", "Gender", "Website usability", "Product information", "Security", "Customer service quality"], "ID": "aef981945a5bb3d42b6e9f3c8a8429fd2df082a8"}
{"TITLE": "Facilitating Data Sovereignty and Digital Transformation in Municipalities and Companies: An Examination of the Data for All Initiative", "YEAR": 2023, "KEY FINDINGS": "The paper highlights the importance of data sovereignty and digital transformation in municipalities and companies, and presents the Data for All initiative as a solution to facilitate data-driven decision-making, transparency, and accountability. It also identifies challenges faced by municipalities in adopting data-driven services, including resource constraints, complex data ecosystems, data governance and privacy concerns, limited data culture and awareness, collaboration and interoperability challenges, and fragmented decision-making structures.", "MAIN RESULT": "The Data for All initiative provides a platform for municipalities and companies to access comprehensive and up-to-date knowledge in the field of data, enabling them to make informed decisions and address challenges effectively.", "HYPOTHESIS": "The adoption of data-driven services by municipalities and companies can lead to improved decision-making, increased transparency, and enhanced accountability, ultimately resulting in better outcomes for citizens and customers.", "EXPERIMENT": "To validate this hypothesis, a controlled experiment can be designed to compare the decision-making processes and outcomes of municipalities and companies that have adopted data-driven services with those that have not. The experiment would require: * A sample of 20 municipalities and 20 companies, divided into two groups: a treatment group that adopts data-driven services and a control group that does not. * A data collection platform to gather data on decision-making processes and outcomes, such as policy decisions, resource allocation, and citizen satisfaction. * A survey instrument to assess the level of transparency and accountability in each municipality and company. * A statistical analysis software to compare the outcomes of the treatment and control groups. Steps to follow: 1. Recruit participants and assign them to either the treatment or control group. 2. Provide training and support to the treatment group on the adoption of data-driven services. 3. Collect data on decision-making processes and outcomes over a period of 6 months. 4. Administer the survey instrument to assess transparency and accountability. 5. Analyze the data using statistical software to compare the outcomes of the treatment and control groups. 6. Draw conclusions on the effectiveness of data-driven services in improving decision-making, transparency, and accountability.", "KEYWORDS": ["Data Sovereignty", "Digital Transformation", "Municipalities", "Companies", "Data-Driven Services", "Transparency", "Accountability", "Decision-Making", "Data Governance", "Privacy Concerns", "Collaboration", "Interoperability"], "ID": "af0b871032549eced8fd1dfd824d98330a2d1ea2"}
{"TITLE": "Redesain Website Ventela untuk Meningkatkan User Experience Pengguna Menggunakan Lean UX", "YEAR": 2023, "KEY FINDINGS": "The study found that the Ventela website had several issues, including a lack of navigation, unattractive design, and lack of features such as search bar and login/register functionality. The study used Lean UX methodology to redesign the website, which resulted in a significant improvement in user experience and satisfaction.", "MAIN RESULT": "The redesigned website showed a significant improvement in user experience and satisfaction, with 70% of users reporting that the website was more attractive and easier to use.", "HYPOTHESIS": "The use of Lean UX methodology in website redesign can lead to a significant improvement in user experience and satisfaction, particularly for e-commerce websites.", "EXPERIMENT": {"TITLE": "Validation of Lean UX Methodology in Website Redesign", "OBJECTIVE": "To validate the hypothesis that the use of Lean UX methodology in website redesign can lead to a significant improvement in user experience and satisfaction.", "METHODS": ["Recruit 100 participants and divide them into two groups: a control group and an experimental group.", "Ask the control group to use the original Ventela website and the experimental group to use the redesigned website using Lean UX methodology.", "Measure user experience and satisfaction using surveys and usability testing.", "Compare the results between the two groups to determine if there is a significant difference in user experience and satisfaction."], "EQUIPMENT": ["Computers with internet access", "Survey software", "Usability testing software"]}, "KEYWORDS": ["Website redesign", "Lean UX", "User experience", "E-commerce", "Usability testing", "Survey research", "Human-computer interaction", "Design methodology", "User satisfaction", "Web development"], "ID": "b4a92fcc6c29ff909f4dc5a11863451b261e3c27"}
{"TITLE": "Co-design with Children: Using Participatory Design for Design Thinking and Social and Emotional Learning", "YEAR": 2019, "KEY FINDINGS": "Children made valuable design contributions, including realistic bullying scenarios, language content, user interface design, storyline progression, character profiles, and coping strategies. Participatory design and design thinking stimulated ethical reasoning, reflection, and empathy in children on bullying victimization.", "MAIN RESULT": "The study demonstrates the effectiveness of using participatory design methods to inculcate design thinking in children and sensitize them on bullying victimization.", "HYPOTHESIS": "Participatory design and design thinking can enhance children's creative confidence, social, and emotional learning, leading to improved problem-solving skills and empathy towards bullying victims.", "EXPERIMENT": {"Title": "Design Thinking and Bullying Sensitization in Children", "Objective": "To investigate the impact of participatory design and design thinking on children's creative confidence, social, and emotional learning in the context of bullying sensitization.", "Equipment": "Whiteboards, markers, sticky notes, laptops with design software, and a serious game prototype on bullying victimization.", "Steps": ["Recruit 30 children aged 10-12 and divide them into two groups: a control group and an experimental group.", "Conduct a pre-test to assess children's creative confidence, social, and emotional learning using standardized questionnaires and surveys.", "Provide the experimental group with a participatory design workshop, where they will co-design a serious game on bullying victimization using design thinking principles.", "Conduct a post-test to assess children's creative confidence, social, and emotional learning using standardized questionnaires and surveys.", "Compare the results of the control and experimental groups to determine the impact of participatory design and design thinking on children's creative confidence, social, and emotional learning."]}, "KEYWORDS": ["Design Thinking", "Participatory Design", "Serious Games", "Bullying Sensitization", "Social and Emotional Learning", "Children's Creativity", "Co-Design", "User-Centred Design", "Empathy", "Problem-Solving Skills"], "ID": "b4dcf370ea585f47da3eeb0add9168aace2ab946"}
{"TITLE": "Transformation of Modern Methods and Tools of Management in the Context of Digitalization Challenges", "YEAR": 2023, "KEY FINDINGS": "The paper analyzes the development of scientific thought on the transformation of approaches to digitalization of management processes, and determines the most effective methods and tools of digitalization in modern enterprises. It highlights the importance of digitalization in the context of the Fourth Industrial Revolution, and its impact on business models, cooperation, user interfaces, value creation chains, and traditional automation pyramid.", "MAIN RESULT": "The paper proposes a set of modern methods and tools of digitalization for different structural units of an enterprise, including dashboard management, cloud-based data storage, electronic document management, ERP, HRM, Big Data, IoT, and blockchain.", "HYPOTHESIS": "The implementation of digitalization methods and tools in an enterprise leads to increased productivity, reduced costs, and improved competitiveness in the market.", "EXPERIMENT": "To validate this hypothesis, an experiment can be designed as follows: 1. Select a group of enterprises from different industries that have not implemented digitalization methods and tools. 2. Implement digitalization methods and tools in these enterprises, such as cloud-based data storage, electronic document management, and ERP. 3. Measure the productivity, costs, and competitiveness of these enterprises before and after the implementation of digitalization methods and tools. 4. Compare the results with a control group of enterprises that have not implemented digitalization methods and tools. 5. Analyze the data using statistical methods to determine the significance of the results. Required equipment: - Cloud-based data storage software - Electronic document management software - ERP software - Productivity and cost measurement tools - Competitiveness assessment tools Steps to follow: 1. Select the enterprises and implement digitalization methods and tools. 2. Collect data on productivity, costs, and competitiveness before and after implementation. 3. Analyze the data using statistical methods. 4. Compare the results with the control group. 5. Draw conclusions and validate the hypothesis.", "KEYWORDS": ["Digitalization", "Management", "Enterprise", "Productivity", "Costs", "Competitiveness", "Cloud-based data storage", "Electronic document management", "ERP", "Big Data", "IoT", "Blockchain", "Fourth Industrial Revolution"], "ID": "b671eac2f9a15c9f326099d3366e254c5e43c7cb"}
{"TITLE": "A Natural Interaction Method of Multi-Sensory Channels for Virtual Assembly System of Power Transformer Control Cabinet", "YEAR": 2020, "KEY FINDINGS": "The paper proposes a virtual assembly system that integrates multiple natural interaction modes, including gesture interaction, Chinese speech interaction, tactile interaction, 3D display, and real-time display of real environment pictures. The system is designed to improve the operability and immersion experience of the virtual environment.", "MAIN RESULT": "The experimental results show that the virtual assembly system with natural interaction of multi-sensory channels is flexible and immersive.", "HYPOTHESIS": "The use of multi-sensory channels in virtual assembly systems can improve the learning efficiency and reduce the assembly time of learners.", "EXPERIMENT": {"TITLE": "Validation of Multi-Sensory Channels in Virtual Assembly Systems", "OBJECTIVE": "To validate the hypothesis that the use of multi-sensory channels in virtual assembly systems can improve the learning efficiency and reduce the assembly time of learners.", "EQUIPMENT": "Virtual assembly system with multi-sensory channels (gesture interaction, Chinese speech interaction, tactile interaction, 3D display, and real-time display of real environment pictures), Oculus Rift CV1, Leap Motion, computer with Unity platform", "STEPS": ["Recruit 20 participants with no prior experience in virtual assembly systems", "Divide participants into two groups: one group uses the virtual assembly system with multi-sensory channels, and the other group uses a traditional virtual assembly system with single-sensory channel", "Ask participants to complete a series of assembly tasks using the assigned system", "Measure the time taken to complete each task and the number of errors made", "Compare the results between the two groups to determine if the use of multi-sensory channels improves learning efficiency and reduces assembly time"]}, "KEYWORDS": ["Virtual assembly system", "Multi-sensory channels", "Natural interaction", "Power transformer control cabinet", "Gesture interaction", "Chinese speech interaction", "Tactile interaction", "3D display", "Real-time display", "Virtual reality"], "ID": "babb9f9239dd7d7d4311a2b9592f72727da63ed3"}
{"TITLE": "Citizen Engagement through Design Space Exploration: Integrating citizen knowledge and expert design in computational urban planning", "YEAR": 2020, "KEY FINDINGS": "The paper presents a Grasshopper and Rhino-based approach that allows designers to share a subset of a parametric design space with citizens via an online interface called Beta.Speckle. The user study evaluated the usability of the tool and found that citizens' design choices were influenced by preferences for visual order and underlying economic, social, and environmental values.", "MAIN RESULT": "The study demonstrates the potential of design space exploration for citizen engagement in urban planning, highlighting the importance of integrating citizens' values and preferences in the design process.", "HYPOTHESIS": "Citizens' design choices in urban planning are influenced by their individual values and preferences, which can be effectively captured and integrated into the design process through design space exploration.", "EXPERIMENT": {"Title": "Validating the Influence of Citizens' Values on Design Choices", "Objective": "To investigate the relationship between citizens' values and their design choices in urban planning.", "Equipment": "Beta.Speckle online interface, Grasshopper and Rhino software, survey questionnaire", "Steps": ["Recruit 50 citizens with diverse backgrounds and values", "Ask participants to complete a survey questionnaire to assess their values and preferences", "Provide participants with access to the Beta.Speckle online interface and ask them to explore and select their preferred urban design options", "Analyze the relationship between participants' values and their design choices using statistical analysis", "Compare the results with a control group that did not complete the survey questionnaire"]}, "KEYWORDS": ["Citizen Engagement", "Design Space Exploration", "Parametric Urban Design", "Computational Urban Planning", "Urban Planning", "Participatory Design", "Grasshopper", "Rhino", "Beta.Speckle", "Values and Preferences"], "ID": "bc97c74ff757f7f54e80c07725b83a4eb0c8d3d7"}
{"TITLE": "Easymap: A User-Friendly Software Package for Rapid Mapping-by-Sequencing of Point Mutations and Large Insertions", "YEAR": 2021, "KEY FINDINGS": "The paper presents Easymap, a software package that simplifies the data analysis workflows from raw NGS reads to candidate mutations for mapping-by-sequencing experiments. Easymap can perform bulked segregant mapping of point mutations induced by ethyl methanesulfonate (EMS) with DNA-seq or RNA-seq datasets, as well as tagged-sequence mapping for large insertions, such as transposons or T-DNAs.", "MAIN RESULT": "Easymap is a user-friendly software package that can rapidly identify candidate mutations in mapping-by-sequencing experiments, making it accessible to researchers with minimal bioinformatics experience.", "HYPOTHESIS": "Easymap can be used to identify novel genes involved in specific biological processes by rapidly mapping mutations that cause specific phenotypes.", "EXPERIMENT": "To validate this hypothesis, an experiment can be designed to identify novel genes involved in plant drought tolerance using Easymap. The experiment would involve: 1) generating a mutant population of Arabidopsis thaliana using EMS mutagenesis, 2) screening the mutants for drought tolerance, 3) selecting mutants that exhibit increased drought tolerance, 4) performing whole-genome sequencing on the selected mutants, 5) using Easymap to identify candidate mutations associated with drought tolerance, 6) validating the candidate genes using gene expression analysis and functional assays. Required equipment: Illumina HiSeq 4000 for whole-genome sequencing, Easymap software, and a plant growth chamber for drought tolerance assays.", "KEYWORDS": ["Easymap", "mapping-by-sequencing", "point mutations", "large insertions", "NGS", "bioinformatics", "forward genetics", "linkage analysis", "Arabidopsis thaliana", "drought tolerance"], "ID": "c35703c9b568d77745bddf91d6ba4b8c95aa91e3"}
{"TITLE": "Improving User Experience: Designing an Intuitive and Visually Appealing Interface for University First Contact and Ombudsman Services for the Centro Universitario del Sur", "YEAR": 2023, "KEY FINDINGS": "The paper highlights the importance of improving the user experience of the University of Guadalajara's online services for reporting and seeking help for gender violence, harassment, and bullying. The current website is found to be static, with too much text and lacking in images, making it difficult for users to navigate and find information. The paper proposes a 4-stage methodology to design a new interface that is intuitive, visually appealing, and conveys professionalism, transparency, trust, and accessibility.", "MAIN RESULT": "The paper aims to design a new interface that enhances the user experience, increases trust, and facilitates access to resources for victims of gender violence.", "HYPOTHESIS": "A user-centered design approach that incorporates feedback from users and experts can lead to a significant improvement in the usability and effectiveness of online services for reporting and seeking help for gender violence, harassment, and bullying.", "EXPERIMENT": "To validate this hypothesis, a usability study can be conducted to compare the current website with a newly designed interface. The experiment would require: * 20 participants (10 users and 10 experts) * The current website and the newly designed interface * A usability testing software (e.g. UserTesting, TryMyUI) * A survey questionnaire to gather feedback and opinions Steps to follow: 1. Recruit participants and divide them into two groups: users and experts. 2. Ask each participant to complete a series of tasks on both the current website and the newly designed interface, such as finding information on reporting a complaint or seeking help. 3. Record the participants' interactions with the websites using the usability testing software. 4. Ask participants to complete a survey questionnaire to gather feedback and opinions on the usability, accessibility, and effectiveness of both websites. 5. Analyze the results to compare the usability and effectiveness of the current website with the newly designed interface.", "KEYWORDS": ["User Experience", "Gender Violence", "Harassment", "Bullying", "University Services", "Online Reporting", "User-Centered Design", "Usability Testing", "Accessibility", "Trust"], "ID": "c4d4ccdca53d37f8b8c8c043ab3c8fa6e02456c3"}
{"TITLE": "Enhancing User Engagement in Local Energy Initiatives Using Smart Local Energy Engagement Tools: A Meta Study", "YEAR": 2023, "KEY FINDINGS": "The study examines the prevalence, effectiveness, and inclusiveness of 84 Smart Local Energy Engagement Tools (SLEETs) deployed in 72 local energy projects in the UK from 2008 to 2018. Information-driven tools were the most popular in community energy groups, while digital energy platforms or interaction tools with numeric interfaces were the most popular in smart local energy system (SLES) initiatives.", "MAIN RESULT": "Effective SLEETs stimulate engagement amongst people (social engagement), and between people and technology (operation and control), while inclusive SLEETs enable the inclusion of vulnerable and low-income households.", "HYPOTHESIS": "The deployment of SLEETs with visual interfaces can lead to higher user engagement and energy savings compared to SLEETs with numeric interfaces.", "EXPERIMENT": {"Title": "Comparing the Effectiveness of SLEETs with Visual and Numeric Interfaces", "Objective": "To investigate whether SLEETs with visual interfaces lead to higher user engagement and energy savings compared to SLEETs with numeric interfaces.", "Equipment": "Two types of SLEETs with identical functionality but different interfaces (visual and numeric), 100 participants, energy meters, and survey questionnaires.", "Steps": "1. Recruit 100 participants and randomly assign them to use either a visual or numeric SLEET for 6 months. 2. Monitor energy consumption and user engagement (e.g., frequency of logins, duration of use) for both groups. 3. Conduct surveys to assess user experience and satisfaction. 4. Compare energy savings and user engagement between the two groups."}, "KEYWORDS": ["Smart Local Energy Engagement Tools", "User Engagement", "Local Energy Initiatives", "Community Energy", "Smart Energy Systems", "Energy Efficiency", "Sustainable Development", "Energy Management", "Digital Energy Platforms", "Energy Feedback"], "ID": "c52ebc5232a1169863f44c0307ca0ee96868b8ef"}
{"TITLE": "Instant Flood Risk Modelling (Inform) Tool for Co-Design of Flood Risk Management Strategies with Stakeholders in Can Tho City, Vietnam", "YEAR": 2021, "KEY FINDINGS": "The paper presents a web-based hydraulic tool, Inform, to support flood risk management (FRM) in Can Tho city, Vietnam. Inform is designed to satisfy user requirements, allowing users to assess different scenarios and receive visual outputs within one minute.", "MAIN RESULT": "Inform is a reliable co-design tool for developing FRM strategies, featuring an inbuilt input library, flexible options, ease of use, quick results, and a user-friendly interface.", "HYPOTHESIS": "The use of interactive flood risk tools like Inform can increase stakeholder engagement and participation in flood risk management decision-making processes, leading to more effective and sustainable flood risk reduction strategies.", "EXPERIMENT": {"Title": "Evaluating the Effectiveness of Inform in Stakeholder Engagement", "Objective": "To assess the impact of Inform on stakeholder engagement and participation in flood risk management decision-making processes.", "Equipment": "Inform tool, survey questionnaires, stakeholder groups", "Steps": ["Recruit stakeholder groups (n=50) with varying levels of flood risk management expertise", "Divide stakeholders into two groups: one using Inform and one without", "Conduct a flood risk management decision-making exercise using Inform for the treatment group", "Administer survey questionnaires to both groups to assess engagement, participation, and perceived effectiveness of flood risk reduction strategies", "Compare results between groups to evaluate the impact of Inform on stakeholder engagement and participation"]}, "KEYWORDS": ["Flood Risk Management", "Co-Design", "Stakeholder Engagement", "Interactive Tools", "Web-Based Modelling", "Flood Risk Reduction", "Can Tho City", "Vietnam", "Decision-Making", "Sustainable Development"], "ID": "c66204a637d2bbe6dcec06d27e063f445f575c72"}
{"TITLE": "Investigation of Input Modalities Based on a Spatial Region Array for Hand-Gesture Interfaces", "YEAR": 2021, "KEY FINDINGS": "The study found that users can easily control a 5x5 target block array with a size of 60.8 mm x 48 mm, and that sighted and visually impaired individuals have different spatial controllability patterns.", "MAIN RESULT": "The common operational region for hand gestures was found to be a rectangle of 240 mm x 304 mm, located 80 mm above the desktop.", "HYPOTHESIS": "Visually impaired individuals will have improved spatial controllability when using a spatial region array with a larger target size and a more intuitive spatial partitioning strategy.", "EXPERIMENT": {"TITLE": "Evaluating the Effect of Target Size and Spatial Partitioning on Spatial Controllability in Visually Impaired Individuals", "EQUIPMENT": "Leap Motion controller, computer, Unity 3D software, and a spatial region array with varying target sizes and partitioning strategies", "STEPS": ["Recruit 20 visually impaired participants and 20 sighted participants", "Have each participant complete a series of target selection tasks using the Leap Motion controller and the spatial region array with varying target sizes and partitioning strategies", "Record the participants' performance and spatial controllability patterns", "Compare the results between the visually impaired and sighted groups to evaluate the effect of target size and spatial partitioning on spatial controllability"]}, "KEYWORDS": ["Hand-gesture interfaces", "Spatial region array", "Visually impaired individuals", "Spatial controllability", "Leap Motion controller", "Unity 3D", "Target selection", "Human-computer interaction", "Gesture recognition", "Accessibility"], "ID": "c6da071f9954dbfbd5433a9bb70b94c476e9eabf"}
{"TITLE": "UQE-3D: a usability evaluation method of 3D user interfaces for the elderly", "YEAR": 2023, "KEY FINDINGS": "The paper presents a new usability evaluation method, UQE-3D, specifically designed for 3D user interfaces for the elderly. The method was validated through an experiment with 30 elderly participants, showing good results with a mean score of 82.60.", "MAIN RESULT": "The UQE-3D method is effective in identifying usability issues in 3D user interfaces for the elderly.", "HYPOTHESIS": "The use of UQE-3D can improve the design of 3D user interfaces for the elderly, leading to increased user satisfaction and engagement.", "EXPERIMENT": {"TITLE": "Validation of UQE-3D in improving 3D user interface design for the elderly", "EQUIPMENT": "VR headset, 3D user interface prototype, UQE-3D questionnaire", "STEPS": ["Recruit 30 elderly participants", "Divide participants into two groups: control group and experimental group", "Have control group interact with a 3D user interface designed without UQE-3D, and experimental group interact with a 3D user interface designed with UQE-3D", "Administer UQE-3D questionnaire to both groups after interaction", "Compare user satisfaction and engagement scores between the two groups"]}, "KEYWORDS": ["3D user interface", "usability evaluation", "elderly", "UQE-3D", "virtual reality", "augmented reality", "user experience", "human-computer interaction", "gerontechnology", "healthcare technology"], "ID": "c8a1830504635b55ee787684a5c19404ab234209"}
{"TITLE": "Designing UI/UX Mobile Application for Up Store Using Figma", "YEAR": 2023, "KEY FINDINGS": "The study used Design Thinking to develop a mobile application for Up Store, a online clothing retailer, and found that the application's UI/UX design was effective in improving user experience and increasing sales.", "MAIN RESULT": "The study found that 92.5% of users were satisfied with the UI/UX design of the application.", "HYPOTHESIS": "The use of Design Thinking in mobile application development leads to a significant improvement in user experience and sales.", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of Design Thinking in Mobile Application Development", "OBJECTIVE": "To validate the hypothesis that the use of Design Thinking in mobile application development leads to a significant improvement in user experience and sales.", "METHODS": ["Recruit 100 participants to test two versions of a mobile application: one developed using Design Thinking and the other using traditional development methods.", "Ask participants to complete a series of tasks on both applications and provide feedback on their experience.", "Measure the time taken to complete tasks, user satisfaction, and sales conversion rates for both applications.", "Compare the results to determine if the application developed using Design Thinking performs better than the traditional application."], "EQUIPMENT": ["Mobile devices with the two versions of the application installed", "Survey software to collect user feedback", " Stopwatch or timer to measure task completion time"]}, "KEYWORDS": ["Design Thinking", "UI/UX Design", "Mobile Application Development", "User Experience", "Sales Conversion", "Figma", "Up Store", "E-commerce", "Mobile Commerce", "Human-Computer Interaction"], "ID": "c9a2bd66912d8575512f7bc47937927d1c783671"}
{"TITLE": "Artificial Intelligence-Assisted Online Social Therapy for Youth Mental Health", "YEAR": 2017, "KEY FINDINGS": "The paper discusses the development of the Moderated Online Social Therapy (MOST) web application, which provides an interactive social media-based platform for recovery in mental health. The system integrates online peer support and evidence-based interventions with a clinician and consumer-centered service delivery process.", "MAIN RESULT": "The MOST model has been effectively implemented in six studies, including four pilot studies, and has demonstrated viability in a series of clinical research trials.", "HYPOTHESIS": "The incorporation of advanced computational and artificial intelligence methods can supplement the support provided by moderators/clinicians and automate user-tailored therapy, leading to improved engagement and outcomes for users.", "EXPERIMENT": {"Title": "Evaluating the Efficacy of AI-Assisted Online Social Therapy", "Objective": "To investigate the effectiveness of AI-assisted online social therapy in improving engagement and outcomes for youth with mental health conditions.", "Design": "Randomized controlled trial", "Participants": "100 youth with mental health conditions", "Intervention": "MOST platform with AI-assisted therapy content delivery", "Control": "MOST platform with standard therapy content delivery", "Outcome Measures": "User engagement, symptom severity, and quality of life", "Equipment": "Computers or mobile devices with internet access, MOST platform software", "Steps": "1. Recruit participants and randomly assign to intervention or control group. 2. Participants complete baseline assessments. 3. Participants access the MOST platform for 12 weeks. 4. Participants complete follow-up assessments at 12 weeks and 24 weeks. 5. Compare outcomes between intervention and control groups."}, "KEYWORDS": ["Youth mental health", "Online social therapy", "Artificial intelligence", "Moderated online social therapy", "Mental health interventions", "Digital health", "E-therapy", "Online support groups", "Therapy content delivery", "User engagement"], "ID": "d04b5aec72787824a57d85fc1876e1a5e4bfb218"}
{"TITLE": "Efﬁcient Digital Signage-Based Online Store Layout: An Experimental Study", "YEAR": 2016, "KEY FINDINGS": "The study explores the effect of different store layouts on customer behavior in a digital signage-based online store. The layouts tested were tree, pipeline, and guiding pathway. The results show that the layout significantly affects customer behavior, including planned purchases, ease of navigation, perceived entertainment, and time spent in the store.", "MAIN RESULT": "The study suggests that a well-designed digital signage-based online store layout can enhance customer experience and increase sales.", "HYPOTHESIS": "A digital signage-based online store with a guiding pathway layout will lead to higher customer satisfaction and increased sales compared to other layouts.", "EXPERIMENT": {"Objective": "To validate the hypothesis that a guiding pathway layout in a digital signage-based online store leads to higher customer satisfaction and increased sales.", "Equipment": "Digital signage system with touch screen, three different layout designs (tree, pipeline, and guiding pathway), and a survey questionnaire.", "Steps": ["1. Recruit participants and randomly assign them to one of the three layout groups.", "2. Ask participants to use the digital signage system to browse and purchase products.", "3. Measure the time spent in the store, number of products purchased, and customer satisfaction using a survey questionnaire.", "4. Compare the results across the three layout groups to determine which layout leads to higher customer satisfaction and increased sales."]}, "KEYWORDS": ["Digital signage", "Online store layout", "Customer behavior", "Guiding pathway layout", "Tree layout", "Pipeline layout", "Customer satisfaction", "Sales", "Retailing", "Human-computer interaction"], "ID": "d249dfdfcdf60a0e519d9c5b2622eaf4503ff424"}
{"TITLE": "An FCNN-Based Super-Resolution MMWave Radar Framework for Contactless Musical Instrument Interface", "YEAR": 2021, "KEY FINDINGS": "The paper proposes a novel framework for contactless human-computer interaction using deep learning-based super-resolution and tracking algorithms with millimeter-wave (mmWave) radar. The framework achieves high-resolution tracking of hand position and motion characteristics, and is demonstrated as a musical interface.", "MAIN RESULT": "The proposed framework improves the localization accuracy of hand tracking using mmWave radar, enabling fine motion tracking and robust gesture recognition.", "HYPOTHESIS": "The use of deep learning-based super-resolution algorithms can significantly improve the accuracy and robustness of hand tracking using mmWave radar, enabling new applications in human-computer interaction and gesture recognition.", "EXPERIMENT": {"Objective": "To validate the hypothesis by comparing the hand tracking accuracy of the proposed framework with traditional radar signal processing methods.", "Equipment": "mmWave radar sensor, computer with deep learning software, musical instrument interface", "Steps": ["1. Collect radar data of hand movements using the mmWave radar sensor.", "2. Process the data using traditional radar signal processing methods and the proposed deep learning-based super-resolution algorithm.", "3. Compare the hand tracking accuracy of both methods using metrics such as mean squared error and root mean squared error.", "4. Evaluate the robustness of the proposed framework to variations in hand movement speed, direction, and orientation."]}, "KEYWORDS": ["millimeter-wave radar", "deep learning", "super-resolution", "hand tracking", "gesture recognition", "human-computer interaction", "musical instrument interface", "contactless interface", "radar signal processing", "FCNN"], "ID": "d26cc316b21233b00abba4dcd975046928de6830"}
{"TITLE": "E-Commerce Recommendation System", "YEAR": 2024, "KEY FINDINGS": "The paper provides a comprehensive analysis of various methodologies, techniques, and advancements in E-commerce Product Recommendation Systems (EPRS). It highlights the importance of personalized recommendations in driving user engagement and satisfaction, and explores the underlying principles and algorithms employed in EPRS, including collaborative filtering, content-based filtering, and hybrid approaches.", "MAIN RESULT": "The paper concludes that EPRS can enhance customer satisfaction, foster brand loyalty, and drive sustainable growth in the competitive landscape of e-commerce.", "HYPOTHESIS": "The use of hybrid recommendation filtering techniques that combine the strengths of collaborative filtering and content-based filtering can lead to more accurate and personalized recommendations, resulting in increased user engagement and conversion rates.", "EXPERIMENT": {"Title": "Hybrid Recommendation Filtering Experiment", "Objective": "To validate the hypothesis that hybrid recommendation filtering techniques can lead to more accurate and personalized recommendations.", "Equipment": "E-commerce platform with user interaction data, recommendation algorithms (collaborative filtering, content-based filtering, and hybrid), and evaluation metrics (precision, recall, coverage, and serendipity).", "Steps": ["Collect user interaction data from an e-commerce platform.", "Implement collaborative filtering, content-based filtering, and hybrid recommendation algorithms.", "Evaluate the performance of each algorithm using precision, recall, coverage, and serendipity metrics.", "Compare the performance of the hybrid algorithm with the individual algorithms.", "Analyze the results to determine if the hybrid algorithm leads to more accurate and personalized recommendations."]}, "KEYWORDS": ["Recommendation Algorithms", "Cross-selling", "Trust Recommendations", "Customer Lifetime Value", "User-item Interaction Data", "Personalization", "E-commerce", "Product Recommendation Systems", "User Engagement", "Deep Learning", "Content-based Filtering"], "ID": "d337b058c7699a519f69a0a4b8a13725806e40c6"}
{"TITLE": "Pengembangan Platform Coffee Shop KURLEB dengan Fokus pada User Interface dan Prinsip UX Law", "YEAR": 2023, "KEY FINDINGS": "The paper presents the development of a digital platform for a coffee shop, KURLEB, focusing on user interface and UX Law principles. The platform aims to provide an effective digital medium for promoting, storing, and providing information about the coffee shop, enhancing customer engagement and loyalty.", "MAIN RESULT": "The research successfully built a UI prototype of the KURLEB website, transforming it into an effective digital platform for promoting, storing, and providing information about Kopi KurangLebih, and achieving a good user experience by providing relevant information, intuitive navigation, and appealing visual aesthetics.", "HYPOTHESIS": "The use of a well-designed UI and UX Law principles in a coffee shop's digital platform can increase customer loyalty and engagement, leading to increased sales and competitiveness in the market.", "EXPERIMENT": {"Title": "Evaluating the Effectiveness of a Well-Designed UI and UX Law Principles on Customer Loyalty and Engagement in a Coffee Shop's Digital Platform", "Equipment": "Smartphones or computers with internet access, KURLEB website, survey questionnaire", "Steps": ["Recruit 100 participants and divide them into two groups: one group will use the current KURLEB website, and the other group will use the redesigned website with a well-designed UI and UX Law principles.", "Ask participants to complete a survey questionnaire to assess their user experience, satisfaction, and loyalty to the coffee shop before and after using the website.", "Compare the results of the two groups to evaluate the effectiveness of the redesigned website in increasing customer loyalty and engagement.", "Conduct a follow-up survey after 3 months to assess the long-term impact of the redesigned website on customer loyalty and engagement."]}, "KEYWORDS": ["Coffee Shop", "Digital Platform", "User Interface", "UX Law", "Customer Loyalty", "Customer Engagement", "E-commerce", "Web Design", "Human-Computer Interaction", "User Experience"], "ID": "d7ce0d1ee32fc76bb697afa56b358497c4a6cde9"}
{"TITLE": "The Impact of Instagram's Corporate Strategy on Consumer Preferences", "YEAR": 2023, "KEY FINDINGS": "Instagram's corporate strategy has a significant impact on consumer preferences, particularly in terms of its software capabilities, content delivery, and seamless integration of music. The platform's ability to deliver highly targeted ads based on user interests and demographics further enhances its impact on consumer preferences, increasing brand awareness and driving sales.", "MAIN RESULT": "Instagram's corporate strategy has a profound influence on consumer behavior patterns and overall satisfaction levels.", "HYPOTHESIS": "The integration of music in Instagram's content delivery mechanism has a significant impact on user engagement and brand awareness.", "EXPERIMENT": {"TITLE": "The Effect of Music Integration on User Engagement and Brand Awareness on Instagram", "OBJECTIVE": "To investigate the impact of music integration on user engagement and brand awareness on Instagram.", "EQUIPMENT": "Instagram accounts, music integration feature, user engagement metrics (e.g. likes, comments, shares), brand awareness metrics (e.g. brand recognition, brand recall)", "STEPS": ["1. Create two identical Instagram accounts, one with music integration and one without.", "2. Post identical content on both accounts for a period of 6 weeks.", "3. Measure user engagement metrics (e.g. likes, comments, shares) for both accounts.", "4. Conduct a survey to measure brand awareness metrics (e.g. brand recognition, brand recall) for both accounts.", "5. Compare the results to determine the impact of music integration on user engagement and brand awareness."]}, "KEYWORDS": ["Instagram", "Corporate Strategy", "Consumer Preferences", "Software Capabilities", "Content Delivery", "Music Integration", "User Engagement", "Brand Awareness", "Targeted Advertising", "Social Media Marketing"], "ID": "dc4db202e58d546578ea4cb7cfecca4732e5af93"}
{"TITLE": "Використання чат-ботів у торгівлі будівельними матеріалами", "YEAR": 2022, "KEY FINDINGS": "The paper explores the potential of chatbots in the construction materials trade, highlighting their advantages over traditional marketing tools, such as websites. It also presents a chatbot-based system for selecting and calculating the required building materials, which can increase sales and reduce operational costs.", "MAIN RESULT": "The use of chatbots in the construction materials trade can increase sales, reduce operational costs, and improve customer satisfaction.", "HYPOTHESIS": "The use of chatbots in the construction materials trade can lead to a significant increase in sales and customer satisfaction, particularly among younger customers who are more familiar with digital technologies.", "EXPERIMENT": {"Objective": "To validate the hypothesis that the use of chatbots in the construction materials trade can lead to a significant increase in sales and customer satisfaction.", "Equipment": "A chatbot platform, a website or mobile application, a customer database, and sales data analytics tools.", "Steps": ["1. Develop a chatbot platform that can assist customers in selecting and calculating the required building materials.", "2. Integrate the chatbot platform with a website or mobile application.", "3. Recruit a group of customers to participate in the experiment, divided into two groups: a control group that will use the traditional website or mobile application, and an experimental group that will use the chatbot platform.", "4. Collect sales data and customer satisfaction surveys from both groups over a period of three months.", "5. Analyze the data to compare the sales and customer satisfaction rates between the two groups."]}, "KEYWORDS": ["chatbots", "construction materials trade", "e-commerce", "digital marketing", "customer satisfaction", "sales increase", "operational costs reduction", "artificial intelligence", "machine learning", "natural language processing"], "ID": "dd28f703af4137e99b3ee0c42fd4837f60c4f912"}
{"TITLE": "Implementation Of Teak Furniture Sales Information System In Mass Furniture Shop", "YEAR": 2022, "KEY FINDINGS": "The development of a website-based furniture sales application using PHP and MySQL can assist the shop in the sales process, making data recording processes and transactions more effective and efficient.", "MAIN RESULT": "The application can help the Mass Furniture Store in marketing the products, expand the marketing area, and make it easier for consumers to place orders.", "HYPOTHESIS": "The implementation of an e-commerce-based sales information system can increase the sales revenue of the Mass Furniture Store by at least 20% within the first six months of operation.", "EXPERIMENT": {"TITLE": "E-commerce-based Sales Information System Effectiveness Experiment", "EQUIPMENT": ["Computer with internet connection", "PHP and MySQL software", "Mass Furniture Store sales data"], "STEPS": ["1. Develop and implement the e-commerce-based sales information system for the Mass Furniture Store.", "2. Collect sales data for six months prior to the implementation of the system.", "3. Collect sales data for six months after the implementation of the system.", "4. Compare the sales revenue of the two periods to determine if there is a significant increase.", "5. Analyze the data to determine the effectiveness of the system in increasing sales revenue."]}, "KEYWORDS": ["Furniture Sales", "Information System", "E-commerce", "PHP", "MySQL", "Sales Revenue", "Marketing", "Online Sales", "Teak Furniture", "Mass Furniture Store"], "ID": "e048a157b56b224a6c34b283cef17142c0c2bcce"}
{"TITLE": "A Patient-Centered Information System (myED) for Emergency Care Journeys: Design, Development, and Initial Adoption", "YEAR": 2020, "KEY FINDINGS": "The study developed and tested a patient-centered information system, myED, which provides patients with real-time information about their emergency department (ED) journey, including procedures, waiting times, and expected length of stay. The system was found to improve patients' understanding of their ED journey and was well-received by patients and healthcare providers.", "MAIN RESULT": "The study found that 30.48% of patients used myED during the third month of deployment, and patients who used myED had a significant improvement in their understanding of their ED journey.", "HYPOTHESIS": "Providing patients with real-time information about their ED journey through a patient-centered information system like myED can reduce anxiety and improve patient satisfaction in the ED.", "EXPERIMENT": {"Title": "The Effect of myED on Patient Anxiety and Satisfaction in the ED", "Objective": "To investigate the effect of myED on patient anxiety and satisfaction in the ED.", "Design": "Randomized controlled trial", "Participants": "500 patients presenting to the ED", "Intervention": "Patients will be randomly assigned to either the myED group or a control group. The myED group will have access to the myED system, while the control group will not.", "Outcome Measures": "Patient anxiety levels will be measured using a standardized anxiety scale, and patient satisfaction will be measured using a standardized satisfaction survey.", "Equipment": "myED system, anxiety scale, satisfaction survey", "Steps": "1. Patients will be recruited and randomly assigned to either the myED group or the control group. 2. Patients in the myED group will be given access to the myED system. 3. Patient anxiety levels and satisfaction will be measured at baseline, 30 minutes after arrival, and at discharge. 4. Data will be analyzed using t-tests and regression analysis."}, "KEYWORDS": ["Patient-centered care", "Emergency department", "Health information system", "Patient satisfaction", "Anxiety", "Waiting times", "Length of stay", "Process mining", "User-centered design", "Mobile health"], "ID": "e4d0ce2be368a0ca9a733babbf9513730eb37f8e"}
{"TITLE": "Design Website for Digital Promotion SMEs Product by Optimize SEO Techniques", "YEAR": 2023, "KEY FINDINGS": "The study develops an optimized website design for digital promotion of SME products, incorporating enhanced search engine optimization (SEO) techniques. The methodology involves defining goals and KPIs, competitor analysis, keyword research and mapping, optimized content development, technical site optimization, performance tracking, and continuous improvement.", "MAIN RESULT": "The results demonstrate significant increases across key indicators, highlighting the effectiveness of the proposed approach in bolstering SME digital promotion through optimized website design and SEO.", "HYPOTHESIS": "The use of white hat SEO techniques can significantly improve the visibility and attractiveness of SME websites, leading to increased website traffic and conversions.", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of White Hat SEO Techniques on SME Website Visibility", "OBJECTIVE": "To investigate the impact of white hat SEO techniques on SME website visibility and attractiveness.", "REQUIRED EQUIPMENT": "Website development software, SEO tools (e.g. Google Analytics, Google Search Console), and a sample of SME websites.", "STEPS TO FOLLOW": ["1. Select a sample of SME websites and divide them into two groups: a control group and a treatment group.", "2. Apply white hat SEO techniques to the treatment group, including keyword research, meta description optimization, and internal linking.", "3. Monitor and track the website traffic, bounce rate, and conversion rate of both groups using SEO tools.", "4. Compare the results of the two groups to determine the effectiveness of white hat SEO techniques in improving website visibility and attractiveness."]}, "KEYWORDS": ["SEO", "Digital Promotion", "SMEs", "Website Design", "White Hat SEO", "Keyword Research", "Meta Description", "Internal Linking", "Search Engine Optimization", "Digital Marketing"], "ID": "e67bb38b4480dff25d96324be0de1c556bd4f161"}
{"TITLE": "The Impact of Price Transparency, Safe Transactions, and Delivery Performance on E-commerce Performance in Indonesian Online Supermarkets", "YEAR": 2023, "KEY FINDINGS": "The study reveals that delivery performance and e-commerce performance play critical roles in determining overall e-commerce performance, while price transparency emerges as a crucial factor significantly influencing digital customer retention.", "MAIN RESULT": "The research highlights the importance of delivery reliability, price transparency, and overall e-commerce performance in driving customer satisfaction and retention.", "HYPOTHESIS": "Improving price transparency and delivery performance can lead to increased customer satisfaction and retention in online supermarkets.", "EXPERIMENT": {"Title": "The Effect of Price Transparency and Delivery Performance on Customer Satisfaction and Retention", "Objective": "To investigate the impact of price transparency and delivery performance on customer satisfaction and retention in online supermarkets.", "Equipment": "Online survey platform, online supermarket website/app, customer database", "Steps": ["1. Recruit 500 online supermarket customers and randomly assign them to one of two groups: a control group and a treatment group.", "2. The treatment group will be provided with a website/app that offers transparent pricing information and a reliable delivery system, while the control group will use the regular website/app.", "3. Measure customer satisfaction and retention rates for both groups over a period of 6 months.", "4. Compare the results between the two groups to determine the effect of price transparency and delivery performance on customer satisfaction and retention."]}, "KEYWORDS": ["Price Transparency", "Safe Transactions", "Delivery Performance", "E-commerce Performance", "Digital Customer Retention", "Online Supermarkets", "Customer Satisfaction", "Customer Loyalty", "E-commerce Success Factors", "Indonesian E-commerce Market"], "ID": "e6f87f1f08a44b85d7558a005921334b20194b17"}
{"TITLE": "The Effect of Brand Image, E-Service Quality, and Customer Value on Decisions to Use Traveloka in Semarang", "YEAR": 2022, "KEY FINDINGS": "The study found that brand image, e-service quality, and customer value have a positive influence on purchasing decisions at Traveloka online travel agents.", "MAIN RESULT": "The coefficient of determination of brand image, e-service quality, and customer value on purchasing decisions is 0.662 or 66.2%.", "HYPOTHESIS": "Improving e-service quality and customer value can increase the positive influence of brand image on purchasing decisions at Traveloka online travel agents.", "EXPERIMENT": {"Title": "Evaluating the Effect of E-Service Quality and Customer Value on Brand Image Influence", "Objective": "To investigate the effect of improving e-service quality and customer value on the positive influence of brand image on purchasing decisions at Traveloka online travel agents.", "Equipment": "Online survey platform, Traveloka website, and statistical analysis software.", "Steps": ["Recruit 100 participants who have used Traveloka online travel agents.", "Divide participants into two groups: control group and treatment group.", "Provide the treatment group with improved e-service quality and customer value features on the Traveloka website.", "Conduct an online survey to measure the brand image, e-service quality, customer value, and purchasing decisions of both groups.", "Compare the results of both groups using statistical analysis software to determine the effect of improving e-service quality and customer value on the positive influence of brand image on purchasing decisions."]}, "KEYWORDS": ["Brand Image", "E-Service Quality", "Customer Value", "Purchasing Decisions", "Online Travel Agents", "Traveloka", "Marketing", "Consumer Behavior", "E-Commerce", "Service Quality"], "ID": "e93d4439c74e86b74fcbd027ca846af9df0e5be6"}
{"TITLE": "USER EXPERIENCE SEBAGAI MEDIA MANAJEMEN VALIDASI ATAS KEBUTUHAN USER", "YEAR": 2022, "KEY FINDINGS": "The study found that user research by mapping user needs and outlining them in the definition and ideation method can answer the validation needs of user needs before the application is developed by the programmer engineer, and allows to reduce the potential for failure because it does not answer user needs.", "MAIN RESULT": "The usability test results showed that the implementation of user research can validate user needs and reduce the potential for failure.", "HYPOTHESIS": "The use of user research and ideation methods can improve the user experience and reduce the potential for failure in e-commerce applications.", "EXPERIMENT": {"TITLE": "Validating the Effectiveness of User Research and Ideation in E-commerce Applications", "OBJECTIVE": "To investigate the effectiveness of user research and ideation methods in improving user experience and reducing the potential for failure in e-commerce applications.", "EQUIPMENT": "Smartphones or computers with internet access, e-commerce application prototype, user research and ideation tools (e.g. Figma, Affinity Diagram).", "STEPS": ["Recruit 20 participants and divide them into two groups: one using the e-commerce application with user research and ideation, and the other without.", "Ask participants to complete a series of tasks on the application and provide feedback on their experience.", "Conduct usability testing and gather data on the effectiveness of the application in meeting user needs.", "Compare the results of the two groups and analyze the data to determine the effectiveness of user research and ideation in improving user experience and reducing the potential for failure."]}, "KEYWORDS": ["User Experience", "User Research", "Ideation", "E-commerce", "Usability Testing", "Validation", "Failure Reduction", "Application Development", "Programmer Engineer", "Digital Products"], "ID": "eb4d68f78e2f76f6caf5ff6c504a8b6eb65b88db"}
{"TITLE": "The 2020 Visualization Career Award: Catherine Plaisant", "YEAR": 2020, "KEY FINDINGS": "Catherine Plaisant's comprehensive body of work in data visualization, including contributions to evaluation, benchmarks, case studies, and her specific research focus on event sequence visualization.", "MAIN RESULT": "Catherine Plaisant's work has had a significant impact on the field of data visualization, with her contributions leading to the development of innovative visualization tools and techniques.", "HYPOTHESIS": "The use of interactive visualization tools, such as LifeLines, can improve the analysis and understanding of temporal event sequences in various domains, leading to better decision-making and outcomes.", "EXPERIMENT": {"Title": "Evaluating the Effectiveness of Interactive Visualization Tools for Temporal Event Sequence Analysis", "Objective": "To investigate the impact of interactive visualization tools on the analysis and understanding of temporal event sequences.", "Equipment": "Computer with LifeLines software, dataset of temporal event sequences (e.g. medical records, transportation data), participants with varying levels of expertise in data analysis.", "Steps": ["Recruit participants and divide them into two groups: one using LifeLines and one using traditional analysis methods.", "Provide participants with a dataset of temporal event sequences and ask them to analyze and identify patterns and trends.", "Measure the time taken to complete the task, accuracy of results, and user satisfaction for both groups.", "Compare the results between the two groups to determine the effectiveness of LifeLines in improving the analysis and understanding of temporal event sequences."]}, "KEYWORDS": ["Data Visualization", "Event Sequence Visualization", "Interactive Visualization", "LifeLines", "Temporal Event Sequences", "Data Analysis", "Decision-Making", "Human-Computer Interaction", "Information Visualization", "Visualization Evaluation"], "ID": "eddf174c13d4b823517dc46196a1d5c0c79fb4d9"}
{"TITLE": "To immerse or not? Experimenting with two virtual retail environments", "YEAR": 2017, "KEY FINDINGS": "The study found that telepresence components (control, colour and graphics vividness, and 3D authenticity) play a major role in simulated experience, which in turn affects engagement, enjoyment, satisfaction, and purchase intention. The immersive, 3D environment was found to be more associated with engagement and enjoyment, leading to greater purchase intention.", "MAIN RESULT": "The immersive, 3D environment has the potential to rival traditional shopping in terms of experience, resulting in higher sales for retailers and satisfaction for consumers.", "HYPOTHESIS": "The use of immersive virtual reality technology in retail environments can increase consumer engagement and purchase intention by providing a more realistic and interactive experience.", "EXPERIMENT": {"Objective": "To validate the hypothesis that immersive virtual reality technology can increase consumer engagement and purchase intention in retail environments.", "Equipment": "Virtual reality headsets, data gloves, and a computer with a 3D virtual store environment.", "Steps": ["Recruit participants and randomly assign them to either a 2D or 3D virtual store environment.", "Have participants complete a task in the assigned environment, such as browsing and selecting products.", "Measure participants' engagement, enjoyment, satisfaction, and purchase intention using surveys and behavioral metrics.", "Compare the results between the 2D and 3D environments to determine if the immersive technology has a significant impact on consumer behavior."]}, "KEYWORDS": ["Virtual retail environments", "Immersive technology", "Telepresence", "Simulated experience", "Engagement", "Purchase intention", "E-commerce", "Retailing", "Virtual reality", "3D environments"], "ID": "ee80b02295101a575ea2a64b608cb0017f518a5e"}
{"TITLE": "Development of a Web-Based Monitoring System for Power Tilt-in-Space Wheelchairs: Formative Evaluation", "YEAR": 2019, "KEY FINDINGS": "The study found that users and clinicians appreciated the reminder feature, customization of performance goals, and ease of use of the Web interface. However, they requested improvements to the visual design, learnability, and bidirectionality of the interaction between the user and the clinician.", "MAIN RESULT": "The formative evaluation of the Web-based monitoring system for power tilt-in-space wheelchairs identified the functionalities needed by end users, including users and clinicians.", "HYPOTHESIS": "The use of a Web-based monitoring system for power tilt-in-space wheelchairs can improve the adoption of optimal tilt usage and reduce the incidence of pressure ulcers in wheelchair users.", "EXPERIMENT": {"Objective": "To validate the hypothesis that the use of a Web-based monitoring system for power tilt-in-space wheelchairs can improve the adoption of optimal tilt usage and reduce the incidence of pressure ulcers in wheelchair users.", "Design": "Randomized controlled trial", "Participants": "100 wheelchair users with power tilt-in-space wheelchairs", "Intervention": "Participants will be randomly assigned to either a control group or an intervention group. The intervention group will use the Web-based monitoring system for 6 months, while the control group will receive standard care.", "Outcome measures": "Adoption of optimal tilt usage, incidence of pressure ulcers, and user satisfaction", "Equipment": "Power tilt-in-space wheelchairs, Web-based monitoring system, pressure ulcer assessment tools", "Steps": "1. Recruit participants and assign them to either the control or intervention group. 2. Provide training on the use of the Web-based monitoring system to the intervention group. 3. Collect data on adoption of optimal tilt usage and incidence of pressure ulcers at baseline, 3 months, and 6 months. 4. Analyze data using intention-to-treat principle."}, "KEYWORDS": ["power tilt-in-space wheelchairs", "Web-based monitoring system", "pressure ulcers", "wheelchair users", "rehabilitation", "eHealth", "health behavior", "self-help devices", "remote sensing technology", "technology assessment"], "ID": "ef8f3d9e8fa250be384c108401763a063d4fcb1a"}
{"TITLE": "NOT PROVIDED", "YEAR": 2023, "KEY FINDINGS": "NOT PROVIDED", "MAIN RESULT": "NOT PROVIDED", "HYPOTHESIS": "Since the paper's content is not provided, a novel hypothesis cannot be inferred. However, a general hypothesis related to administration and management could be: 'The implementation of artificial intelligence in management decision-making processes can lead to improved organizational efficiency and productivity.'", "EXPERIMENT": {"TITLE": "Evaluating the Effectiveness of AI in Management Decision-Making", "OBJECTIVE": "To investigate the impact of artificial intelligence on organizational efficiency and productivity in management decision-making processes.", "EQUIPMENT": ["Computer systems with AI software", "Management decision-making simulation software", "Data analysis tools"], "STEPS": ["Recruit 100 participants with management experience and divide them into two groups: AI-assisted and non-AI-assisted.", "Provide both groups with a management decision-making simulation scenario and ask them to make decisions.", "Use AI software to assist the AI-assisted group in making decisions.", "Compare the decision-making time, accuracy, and outcome of both groups.", "Analyze the data using statistical tools to determine the significance of the results."]}, "KEYWORDS": ["Administration", "Management", "Artificial Intelligence", "Decision-Making", "Organizational Efficiency", "Productivity", "Simulation", "Experiment", "AI Software", "Data Analysis"], "ID": "f1d96bcd98187ab96f27b64f9ecadbe63286199b"}
{"TITLE": "Human Factors Engineering and Usability as Key Drivers for Design of Device Suited for Urine Filtration and Enrichment", "YEAR": 2023, "KEY FINDINGS": "The paper highlights the importance of human factors engineering and usability in the design of devices for urine filtration and enrichment, particularly in the context of cancer detection and diagnosis. It emphasizes the need for a user-centered approach to device design, taking into account the needs and preferences of patients and healthcare professionals.", "MAIN RESULT": "The paper proposes that a device designed with human factors engineering and usability principles can improve the efficiency, effectiveness, and user experience of urine filtration and enrichment for cancer detection and diagnosis.", "HYPOTHESIS": "A device designed with human factors engineering and usability principles can increase patient compliance and participation in urine-based cancer screening and diagnosis.", "EXPERIMENT": "To validate this hypothesis, a usability study can be conducted to compare the performance of a device designed with human factors engineering and usability principles with a conventional device. The study can involve 50 patients and 20 healthcare professionals who will use both devices to collect and process urine samples. The experiment will assess the following outcomes: (1) patient compliance and participation rates, (2) user experience and satisfaction, (3) sample quality and yield, and (4) time and effort required for sample collection and processing. The study will require the following equipment: (1) a device designed with human factors engineering and usability principles, (2) a conventional device, (3) urine collection containers, (4) sample processing equipment, and (5) survey and questionnaire tools.", "KEYWORDS": ["Human Factors Engineering", "Usability", "Urine Filtration", "Urine Enrichment", "Cancer Detection", "Cancer Diagnosis", "Device Design", "User-Centered Design", "Patient Compliance", "Healthcare Professionals"], "ID": "f76d28c7af40365e90e6610e0508b89b13bdf369"}
{"TITLE": "Designing effective discussion forum in MOOCs: insights from learner perspectives", "YEAR": 2023, "KEY FINDINGS": "The study highlights the importance of learner perspectives in designing effective discussion forums in MOOCs, and identifies key factors that influence learner engagement and interaction efficiency, including classification of discussion forum posts, design patterns, and usability improvements.", "MAIN RESULT": "The study's findings suggest that improvements in interactive user interfaces, design elements, usability, and time efficiency can enhance the design of asynchronous discussion forums in MOOCs.", "HYPOTHESIS": "The implementation of user-centered design elements and usability improvements in MOOC discussion forums can significantly improve learners' navigation efficiency and overall satisfaction with the learning experience.", "EXPERIMENT": {"Title": "Validating the Effectiveness of User-Centered Design Elements in MOOC Discussion Forums", "Objective": "To investigate the impact of user-centered design elements on learners' navigation efficiency and overall satisfaction with the learning experience in MOOC discussion forums.", "Equipment": "MOOC platform with discussion forum feature, user-centered design elements (e.g. clear categorization, easy-to-use interface), usability testing software (e.g. UserTesting, TryMyUI), survey questionnaire.", "Steps": ["1. Recruit 100 participants and randomly assign them to either a control group (traditional discussion forum design) or an experimental group (user-centered design elements).", "2. Ask participants to complete a series of tasks on the discussion forum, such as finding specific information, posting a comment, and responding to a peer's post.", "3. Use usability testing software to record participants' interactions with the discussion forum and measure navigation efficiency (e.g. time taken to complete tasks, number of clicks).", "4. Administer a survey questionnaire to participants to measure their overall satisfaction with the learning experience and perceived usability of the discussion forum.", "5. Compare the results between the control and experimental groups to determine the effectiveness of user-centered design elements in improving learners' navigation efficiency and overall satisfaction."]}, "KEYWORDS": ["MOOCs", "asynchronous discussion forums", "learner perspectives", "user-centered design", "usability", "interaction efficiency", "online learning", "education technology", "learning experience", "discussion forum design"], "ID": "f8f63182553e99072dac4e6f8423e9309841b00b"}
{"TITLE": "Interface Design for the Mobile Terminal for Furniture Shopping in the Post-epidemic Era: An Empirical Evidence of User Demand Collection", "YEAR": 2023, "KEY FINDINGS": "The study found that users have high expectations for online home class mobile terminals, focusing on after-sales service, personalized service, and better display of product information. The current mobile terminals of furnishings have shortcomings in platform homogeneity, interface layout, and consistency of the performance layer.", "MAIN RESULT": "The study provides insights into the design of mobile terminals for furniture shopping, highlighting the need for personalized service, better display of product information, and optimization of interface layout.", "HYPOTHESIS": "Personalized service and better display of product information can significantly improve user experience and increase user satisfaction in mobile terminals for furniture shopping.", "EXPERIMENT": {"Title": "Evaluating the Effect of Personalized Service and Product Information on User Experience in Mobile Terminals for Furniture Shopping", "Equipment": "Mobile devices with furniture shopping apps, user experience evaluation software", "Steps": ["Recruit 100 participants with furniture shopping needs", "Divide participants into two groups: control group and experimental group", "Provide the control group with a standard furniture shopping app, and the experimental group with a personalized furniture shopping app with better display of product information", "Ask participants to complete a series of tasks on the app, such as searching for products and making a purchase", "Evaluate user experience using user experience evaluation software and surveys", "Compare the results between the control group and experimental group to determine the effect of personalized service and product information on user experience"]}, "KEYWORDS": ["Mobile terminal", "Furniture shopping", "User experience", "Personalized service", "Product information", "Interface design", "Post-epidemic era", "E-commerce", "Online shopping", "User interface"], "ID": "f8fc8667b7459dc83e7f57baa89c92dc5cb7c160"}
{"TITLE": "CUSTOMIZING EXPERIENCES: EXPANDING THE BOUNDARIES BEYOND GAME'S MECHANICS", "YEAR": 2023, "KEY FINDINGS": "The paper explores the concept of customization in games and its impact on user experience. It highlights the significance of customization as a prominent aspect of gaming and reveals that players derive enjoyment from engaging in this activity, considering it an integral part of their gaming journey.", "MAIN RESULT": "The study suggests that customization can serve as a valuable tool to enhance players' sense of attachment to the game universe.", "HYPOTHESIS": "Customization options in games can increase player engagement and overall gaming experience by providing a sense of ownership and control over the game environment.", "EXPERIMENT": {"TITLE": "The Impact of Customization on Player Engagement", "OBJECTIVE": "To investigate the effect of customization options on player engagement and overall gaming experience.", "EQUIPMENT": "A computer or gaming console with a customizable game, survey software, and a sample of participants.", "STEPS": ["Recruit a sample of participants and divide them into two groups: a control group with limited customization options and an experimental group with extensive customization options.", "Have participants play the game for a set amount of time and complete a survey to assess their engagement and overall gaming experience.", "Compare the results between the two groups to determine if the experimental group shows higher levels of engagement and satisfaction.", "Conduct follow-up surveys to assess the long-term impact of customization on player engagement."]}, "KEYWORDS": ["Games", "User Experience", "Game Customization", "Design", "Digital Games", "Flow State", "Immersion", "Player Engagement", "Gaming Industry", "Virtual Environment"], "ID": "f9bff03aacf5a58dc6da2cb75b15d32a60d5cdcf"}
